[
  ["Belgian-Style Flanders Oud Bruin or Oud Red Ales","Ale","Belgian and French Origin Ales","4.8% - 6.6%","5-18 IBU","12-25 SRM","Tulip","45-50° F","Enigma-New Glarus Brewing, Oud Tart-The Bruery, La Folie-New Belgium Brewing Co.","Beef Carbonnade, Mimolette, Pumpkin Pie","The Belgian-style Flanders is an ale with character and balance, thanks to lactic sourness and acetic acid. Cherry-like flavors are acceptable, as is malt sweetness that can lend bitterness and a cocoa-like character. Oak or other wood-like flavors may be present, even if the beer was not aged in barrels. Overall, the style is characterized by slight to strong lactic sourness, and Flanders reds sometimes include a balanced degree of acetic acid. Brettanomyces-produced flavors may be absent or very low. This style is a marvel in flavor complexity, combining malt, yeast, microorganisms, acidity and low astringency from barrel aging.","https://www.craftbeer.com/styles/belgian-style-flanders","8c3c1c","Tulip"  ],
  ["Belgian-Style Dubbel","Ale","Belgian and French Origin Ales","6.3% - 7.6%","20-35 IBU","16-36 SRM","Tulip","50-55° F","Brother David's Double-Anderson Valley Brewing Co., Abbey Dubbel-Elm City Brewing Co., Double-Allagash Brewing Co.","Apple-Smoked Sausage, Washed-Rind Cheeses, Milk Chocolate","The Belgian-style dubbel ranges from brown to very dark in color. They have a malty sweetness and can have cocoa and caramel aromas and flavors. Hop bitterness is medium-low to medium. Yeast-generated fruity esters (especially banana) can be apparent. Often bottle-conditioned, a slight yeast haze and flavor may be evident. “Dubbel” meaning “double,” this beer is still not so big in intensity as to surpass the Belgian-style quadrupel that is often considered its sibling.","https://www.craftbeer.com/styles/belgian-style-dubbel","6b1a16","Tulip"  ],
  ["Belgian-Style Tripel","Ale","Belgian and French Origin Ales","7.1% - 10.1%","20-45 IBU","4-7 SRM","Tulip","40-45° F","Allagash Tripel-Allagash Brewing Co., Tripel-Green Flash Brewing Co., PDA-Black Bottle Brewery","Roasted Turkey, Triple Crème, Caramelized Banana Crème Brulee","Complex, sometimes mild spicy flavor characterizes this style. Yeast-driven complexity is common. Tripels are often on the higher end of the ABV spectrum, yet are approachable to many different palates. These beers are commonly bottle-conditioned and finish dry. The Belgian-style tripel is similar to Belgian-style golden strong ales, but are generally darker and have a more noticeable malt sweetness.","https://www.craftbeer.com/styles/belgian-style-tripel","d1a700","Tulip"  ],
  ["Belgian-Style Quadrupel","Ale","Belgian and French Origin Ales","7.2% - 11.2%","25-50 IBU","8-20 SRM","Tulip","50-55° F","Four-Allagash Brewing Co., The Sixth Glass-Boulevard Brewing Co., Salvation-Russian River Brewing Co.","Roasted Duck, Aged Gouda,  Bread Pudding","The Belgian-style Quadrupel is amber to dark brown in color. Caramel, dark sugar and malty sweet flavors dominate, with medium-low to medium-high hop bitterness. Quads have a relatively light body compared to their alcoholic strength. If aged, oxidative qualities should be mild and not distracting. Sometimes referred to as Belgian strong dark.","https://www.craftbeer.com/styles/belgian-style-quadrupel","a35b20","Tulip"  ],
  ["Belgian-Style Blonde Ale","Ale","Belgian and French Origin Ales","6.3% - 7.9%","15-30 IBU","4-7 SRM","Tulip","45-50° F","Blonde-Allagash Brewing Co., Tiburon Blonde-Marin Brewing Co., Solid Gold-Cannonball Creek Brewing Co.","Sweet and Sour Chicken, Brie, Angel Food Cake","The Belgian-style blonde ale is typically easy-drinking, with a low but pleasing hop bitterness. This is a light- to medium-bodied ale, with a low malt aroma that has a spiced and sometimes fruity-ester character. Sugar is sometimes added to lighten the perceived body. This style is medium in sweetness and not as bitter as Belgian-style tripels or golden strong ales. It is usually brilliantly clear. The overall impression is balance between light sweetness, spice and low to medium fruity ester flavors.","https://www.craftbeer.com/styles/belgian-style-blonde-ale","d1a700","Tulip"  ],
  ["Belgian-Style Pale Ale","Ale","Belgian and French Origin Ales","4% - 6%","20-30 IBU","6-12 SRM","Tulip","40-50° F","Rare Vos-Brewery Ommegang, Saints Devotion-The Lost Abbey, Perdition-Russian River Brewing Co.","Tempura Fried Fish and Chips, Taleggio, Savory Bread Pudding","The Belgian-style pale ale is gold to copper in color and can have caramel or toasted malt flavor. The style is characterized by low but noticeable hop bitterness, flavor and aroma. These beers were inspired by British pale ales. They are very sessionable.","https://www.craftbeer.com/styles/belgian-style-pale-ale","bd841a","Tulip"  ],
  ["Belgian-Style Strong Golden Ale","Ale","Belgian and French Origin Ales","7% - 11%","20-50 IBU","3-10 SRM","Tulip","40-45° F","Pranqster-North Coast Brewing Co., Brooklyn Local 1-Brooklyn Brewery, Treachery-12Degree Brewing","Beer Battered Fried Shrimp, Triple Crème, Baklava","The Belgian-style golden strong ale is fruity, complex and often on the higher end of the ABV spectrum, yet are approachable to many different palates. Look for a characteristic spiciness from Belgian yeast and a highly attenuated dry finish. This style is traditionally drier and lighter in color than a Belgian-style tripel.","https://www.craftbeer.com/styles/belgian-style-golden-strong-ale","cc9d00","Tulip"  ],
  ["Belgian-Style Dark Strong Ale","Ale","Belgian and French Origin Ales","8% - 14%","5-30 IBU","12-22 SRM","Tulip","55-60° F","Blitzen-Lamplighter Brewing Co","","The Belgian Strong Dark Ale is a dark, complex, strong Belgian ale with a delicious blend of malt richness, dark fruit flavors, and spicy elements. Like a larger dubbel, with a fuller body and increased malt richness. Not as bitter or hoppy as a tripel, but of similar strength.","https://beerandbrewing.com/make-your-best-belgian-dark-strong-ale/","94461c","Tulip"  ],
  ["Belgian-Style White (or Wit) / Belgian-Style Wheat","Ale","Belgian and French Origin Ales","4.8% - 5.6%","10-17 IBU","2-4 SRM","Tulip","40-45° F","Optimal Wit-Port City Brewing Co., Ommegang Witte Ale-Brewery Ommegang, White-Allagash Brewing Co.","Moules and Frites, Mascarpone, Panna Cotta","Belgian-style witbier is brewed using unmalted wheat, sometimes oats and malted barley. Witbiers are spiced with coriander and orange peel. A style that dates back hundreds of years, it fell into relative obscurity until it was revived by Belgian brewer Pierre Celis in the 1960s. This style is currently enjoying a renaissance, especially in the American market. “Wit” means “white.”","https://www.craftbeer.com/styles/belgian-style-wit","e1c336","Tulip"  ],
  ["Belgian-Style Gueuze/Lambic","Ale","Belgian and French Origin Ales","5% - 8.9%","9-23 IBU","6-13 SRM","Tulip","40-50° F","American Blackberry Sour-New Glarus Brewing, Sour Reserve-Upland Brewing Co., Supplication-Russian River Brewing Co.","Shellfish, Mascarpone with Fruit, Rich Chocolate Cake","Belgian-style Lambic or Gueuze beers are naturally and spontaneously fermented with high to very high levels of esters, plus bacterial and yeast-derived sourness that sometimes includes acetic flavors. Lambics are not blended, while the gueuze style blends old and new lambics which are re-fermented in the bottle. Historically, they are dry and completely attenuated, exhibiting no residual sweetness either from malt, sugar or artificial sweeteners. Sweet versions may be created through the addition of sugars or artificial sweeteners. Many examples of this style are made to resemble the gueuze lambic beers of the Brussels area, where it originated.","https://www.craftbeer.com/styles/belgian-style-lambic-gueuze","bb801b","Tulip"  ],
  ["Belgian-Style Fruit Lambic","Ale","Belgian and French Origin Ales","5% - 8.9%","15-21 IBU","Varies on Fruit used","Tulip","45-50° F","Cherry Lambic-Upland Brewing Co., Coolship Red-Allagash Brewing Co., Hexotic-Two Roads Brewing Co.","","Often known as cassis, framboise, kriek, or peche, a fruit lambic takes on the color and flavor of the fruit it is brewed with. It can be dry or sweet, clear or cloudy, depending on the ingredients. Notes of Brettanomyces yeast are often present at varied levels. Sourness is an important part of the flavor profile, though sweetness from fruit may diminish the perceived intensity. These flavored lambic beers may be very dry or mildly sweet.","https://www.craftbeer.com/styles/belgian-style-fruit-lambic","b2731e","Tulip"  ],
  ["Belgian-Style Table Beer","Ale","Belgian and French Origin Ales","1% - 3.5%","Varies","2-6 SRM","Tulip","40-45° F","Hoppy Table Beer-Allagasj Brewing Co., Belgian-Style Table Beer-Sierra Nevada Brewing Co.","Fried Foods, Wings","Also translated in French as bière de table, table beers—as we Americans call them—are a low-ABV, malty, Belgian tradition. ... The most striking would be the style's low (low) alcohol content: 1.5 – 3.0% ABV. They're also generally malt forward—hops are mostly a background playe","https://www.allagash.com/blog/what-is-table-beer/?ao_confirm","dab700","Tulip"  ],
  ["Other Belgian-Style Ales","Ale","Belgian and French Origin Ales","","","","","","","","To Be Filled","","pink","Varies"  ],
  ["French-Style Bière de Garde","Ale","Belgian and French Origin Ales","4.4% - 8%","20-30 IBU","6-16 SRM","Tulip","45-55° F","Domaine DuPage-Two Brothers Brewing Co., Biere De Garde, Schlafly Beer-The Saint Louis Brewery, Avant Garde-The Lost Abbey","Roasted Lamb with Mint, Soft Ripened Cheeses, Pecan Pie","Biere de Garde translates as “beer for keeping.” This style is popping up more and more from U.S. producers. Blond, amber and brown versions exist. Biere de garde examples are light amber to chestnut brown or red in color. This style is characterized by a toasted malt aroma and slight malt sweetness. Flavor of alcohol is evident. Often bottle-conditioned, with some yeast character.","https://www.craftbeer.com/styles/biere-de-garde","b2731e","Tulip"  ],
  ["French & Belgian-Style Saison","Ale","Belgian and French Origin Ales","4.4% - 6.8%","20-38 IBU","3-7 SRM","Tulip","45-55° F","Saison-Funkwerks, red Barn-The Lost Abbey, Hennepin-Brewery Ommegang","Seafood, Brie, Lemon Ginger Sorbet","Beers in this category are gold to light amber in color. Often bottle-conditioned, with some yeast character and high carbonation. Belgian-style saison may have Brettanomyces or lactic character, and fruity, horsey, goaty and/or leather-like aromas and flavors. Specialty ingredients, including spices, may contribute a unique and signature character. Commonly called “farmhouse ales” and originating as summertime beers in Belgium, these are not just warm-weather treats. U.S. craft brewers brew them year-round and have taken to adding a variety of additional ingredients.","https://www.craftbeer.com/styles/belgian-style-saison","d4ac00","Tulip"  ],
  ["Classic English-Style Pale Ale","Ale","British Origin Ales","4.5% - 5.5%","20-40 IBU","5-16 SRM","Nonic Pint","50-55° F","5 Barrel Pale Ale-Odell Brewing Co., Royal Scandal-Peticolas Brewing Co., Moondog Ale-Great Lakes Brewing Co.","Roasted Chicken, Fish and Chips, English-Style Cheeses, Maple Bread Pudding","ESB stands for “extra special bitter.” This style is known for its balance and the interplay between malt and hop bitterness. English pale ales display earthy, herbal English-variety hop character. Medium to high hop bitterness, flavor and aroma should be evident. The yeast strains used in these beers lend a fruitiness to their aromatics and flavor, referred to as esters. The residual malt and defining sweetness of this richly flavored and medium bodied.","https://www.craftbeer.com/styles/english-style-pale-ale-esb","b5771d","Nonic"  ],
  ["English-Style India Pale Ale","Ale","British Origin Ales","5% - 7%","35-63 IBU","6-14 SRM","Nonic Pint","45-50° F","Punjabi-CooperSmith's Pub & Brewing, Sam Adams Lattitude 48 Hallertau Mittelfrueh-Boston Beer Co., East India IPA-Brooklyn Brewery","Fettuccine Alfredo, Aged Cheddar, Ginger Spice Cake","Strong, bitter and completely misunderstood, the English India pale ale (or English IPA) bridges the gap between past and present. No other style represents modern craft brewing excitement quite like the IPA, and while this English beer differs widely from the American version it inspires, this strong member of the English pale ale family has plenty of its own to offer — including all of the history behind this variety.","https://www.craftbeer.com/styles/english-style-india-pale-ale","b87b1c","Nonic"  ],
  ["English-Style Bitter","Ale","British Origin Ales","3% -4.2%","20-35 IBU","5-12 SRM","Nonic Pint","50-55° F","Midsummer Fling-Harpoon Brewery, Pale Ale-Rio Blanco Brewing Co., Redfeather-Black Raven Brewing Co.","Roasted Chicken, Fish and Chips, Firm English Cheeses, Oatmeal Raisin Walnut Cookies","The English-style bitter is a very sessionable, lower-alcohol, malt-driven style. Broad style description commonly associated with cask-conditioned beers. The light- to medium-bodied ordinary bitter is gold to copper in color, with a low residual malt sweetness. Hop bitterness is medium.","https://www.craftbeer.com/styles/english-style-bitter","c08913","Nonic"  ],
  ["Special Bitter or Best Bitter","Ale","British Origin Ales","3.8% - 4.6%","25-40 IBU","5-16 SRM","Nonic Pint","50-55° F","London Pride-Fuller's, Bluebird Bitter-Coniston, Lanlord-Timothy Taylor","Roasted Chicken, Fish and Chips, Firm English Cheeses, Oatmeal Raisin Walnut Cookies","A flavorful, yet refreshing, session beer. Some examples can be more malt balanced, but this should not override the overall bitter impression. Drinkability is a critical component of the style; emphasis is still on the bittering hop addition as opposed to the aggressive middle and late hopping seen in American ales.","https://www.bjcp.org/2008styles/style08.php","b5771d","Nonic"  ],
  ["Extra Special Bitter","Ale","British Origin Ales","4.6% - 6.2%","30-50 IBU","6-18 SRM","Nonic Pint","50-55° F","ESB-Fullers, Broadside-Adnams, Bishop's Finger-Shepherd Neame, Ram Rod-Young’s  ","Roasted Chicken, Fish and Chips, Firm English Cheeses, Oatmeal Raisin Walnut Cookies","An average-strength to moderately-strong English ale. The balance may be fairly even between malt and hops to somewhat bitter. Drinkability is a critical component of the style; emphasis is still on the bittering hop addition as opposed to the aggressive middle and late hopping seen in American ales. A rather broad style that allows for considerable interpretation by the brewer.","https://www.bjcp.org/2008styles/style08.php","ad6a20","Nonic"  ],
  ["English-Style Summer Ale","Ale","British Origin Ales","3.7% - 5.1%","20-30 IBU","3-6 SRM","Nonic Pint","50-55° F","Carver County Kölsch–Waconia Brewing, Hometown Blonde–RAM/Big Horn Brewery, Easy Livin’–Crow Peak Brewing","Roasted Chicken, Fish and Chips, Firm English Cheeses, Oatmeal Raisin Walnut Cookies","English Summer Ale is light straw to golden colored with medium-low to medium bitterness, light to medium-light body, and low to medium residual malt sweetness. Torrefied and/or malted wheat are often used in quantities of 25% or less. Malt flavor may be biscuit-like. ","http://beerinfo.com/top-10-english-summer-ales/","d7b200","Nonic"  ],
  ["Scottish-Style Light Ale","Ale","British Origin Ales","2.5% - 3.2%","10-20 IBU","9-17 SRM","Thistle","50-55° F","Scottish Ale-Campbell Brewing Co., Wee Heavy-Maui Brewing Co., Taildragger Clan-Destine-Saddle Mountain Brewing Co.","Variety of Meats and Game, Pungent Cheeses, Creamy Desserts with Fruit","Scottish-style ales vary depending on strength and flavor, but in general retain a malt-forward character with some degree of caramel-like malt flavors and a soft and chewy mouthfeel. Some examples feature a light smoked peat flavor. Hops do not play a huge role in this style. The numbers commonly associated with brands of this style (60/70/80 and others) reflect the Scottish tradition of listing the cost, in shillings, of a hogshead (large cask) of beer. Overly smoked versions would be considered specialty examples.","https://www.bjcp.org/2008styles/style09.php","a86222","Thistle"  ],
  ["Scottish-Style Heavy Ale","Ale","British Origin Ales","3.2% - 3.9%","10-25 IBU","9-17 SRM","Thistle","50-55° F","Caledonian 70/-(Caledonian Amber Ale in the US), Orkney Raven Ale-Belhaven 70","Variety of Meats and Game, Pungent Cheeses, Creamy Desserts with Fruit","Cleanly malty with a drying finish, perhaps a few esters, and on occasion a faint bit of peaty earthiness (smoke). Most beers finish fairly dry considering their relatively sweet palate, and as such have a different balance than strong Scotch ales.","https://www.bjcp.org/2008styles/style09.php","a86222","Thistle"  ],
  ["Scottish-Style Export Ale","Ale","British Origin Ales","3.9% - 5%","15-30 IBU","9-17 SRM","Thistle","50-55° F","Dark Island-Orkney, Export Ale-caledonian, Belhaven Scotish Ale-Belhaven","Variety of Meats and Game, Pungent Cheeses, Creamy Desserts with Fruit","Cleanly malty with a drying finish, perhaps a few esters, and on occasion a faint bit of peaty earthiness (smoke). Most beers finish fairly dry considering their relatively sweet palate, and as such have a different balance than strong Scotch ales.","https://www.bjcp.org/2008styles/style09.php","a86222","Thistle"  ],
  ["English-Style Pale Mild Ale","Ale","British Origin Ales","3% - 5%","15-25 IBU","6-9 SRM","Nonic Pint","50-55° F","Furlongs British Ale-SQZBX Brewery, Good Old Geoff-MacLeod Ale Brewing Co., Single Speed Citra-Fixed Wheel Brewing","Meat Pie, English Cheeses, Burgers","Similar in many ways to an ordinary Bitter, yet not as hoppy, the English Pale Mild Ale is a delicate, malt-forward brew. Lighter in color than Dark Milds, this style ranges from a pale amber to a deep amber or even an amber brown. Fruitiness, sulfur, and buttery diacetyl may be present in the nose, while hops—traditionally English in origin—are generally subdued yet offer a balancing bitterness. ","https://www.beeradvocate.com/beer/styles/76/?sort=avgD","c69306","Nonic"  ],
  ["English-Style Dark Mild Ale","Ale","British Origin Ales","3% - 6%","20-30 IBU","17-34 SRM","Nonic Pint","50-55° F","Fullers X Mild Ale-Zebulon Artisan Ales, Dark-Ivory Bill Brewing Co., Lord Byron's Sour Mash-Books & Brews","Meat Pie, English Cheeses, Burgers","The quintessential British session beer, like its name suggests, a Mild is known for its low level of hop character. Similarly, the alcohol content is traditionally very low, too. Colors can range from medium amber to rich brown. Low carbonation with a nearly still, slightly bubbly head and little to no hop aroma. Grainy to toasty malts might be present, but expect some body from the high dextrins produced during brewing. Traditionally Dark Milds were a draft beer made popular in London and the Midlands of England.","https://www.beeradvocate.com/beer/styles/75/?sort=avgD","6d1c17","Nonic"  ],
  ["English-Style Brown Ale","Ale","British Origin Ales","4% - 5%","15-25 IBU","12-17 SRM","Nonic Pint","50-55° F","Bandit Brown-City Star Brewing, Nautical Nut Brown-AleSmith Brewing Co., Boulder Garden Brown-Orlison Brewing Co.","Roasted Pork, Steak, Nuts, Aged Gouda, Pear Fritters","A bona fide English beer classic, English-style brown ale is easily one of the most iconic beer styles. Toasty, robust and with a bit of chocolate maltiness, the English brown ale is a meal in a glass, but offers unlimited opportunities for memorable food pairings. Neither flashy nor boring, the English brown is a beer with enough variation to keep devotees ordering them time and time again.","https://www.craftbeer.com/styles/english-style-brown-ale","a0571f","Nonic"  ],
  ["Old Ale","Ale","British Origin Ales","6.3% - 9.1%","30-65 IBU","12-30 SRM","Snifter","50-55° F","Irish Walker-Olde Hickory Brewing, Heini's Hooch-The Church Brew Works, Heini's Good Cheer-Roundabout Brewery","Roast Beef and Lamb, Double Gloucester, Spiced Plum Walnut Tart","A distinctive quality of these ales is that their yeast undergoes an aging process (often for years) in bulk storage or through bottle conditioning, which contributes to a rich, wine-like and often sweet oxidation character. Old ales are copper-red to very dark in color. Complex estery character may emerge.","https://www.craftbeer.com/styles/english-style-old-ale","812f1e","Snifter"  ],
  ["Strong Ale","Ale","British Origin Ales","5% - 11%","5-30 IBU","12-22 SRM","Tulip","50-55° F","Hair of the Dog-Deschutes, Ten Tears-Anchorage","Oven-Baked Game, Cheeses, Lasagna","The American Strong Ale is a medium amber to deep copper or light brown colored, strong, full-flavored American ale that challenges and rewards the palate with full malty and hoppy flavors and substantial bitterness. The flavors are bold but complementary, and are stronger and richer than average-strength pale and amber American ales. A fairly broad style that can describe beers labeled in various ways, including modern malty-but-hoppy beers that aren’t quite in the Barleywine class. Generally not as strong and as rich as an American Barley Wine. More malt balanced than an American or Double IPA with more hop intensity than an English Strong Ale style would tolerate.","https://www.ratebeer.com/beerstyles/strong-ale-american/64/","94461c","Tulip"  ],
  ["Scotch Ale","Ale","British Origin Ales","6.2% - 8%","25-35 IBU","15-30 SRM","Thistle","50-55° F","Wee Heavy-Dry Dock Brewing Co., Way Heavy-Pizza Port Brewing Co., Real Heavy,-Real Ale Brewing Co.","Variety of Meats and Game, Pungent Cheeses, Creamy Desserts with Fruit","The Scotch ale is overwhelmingly malty, with a rich and dominant sweet malt flavor and aroma. A caramel character is often part of the profile. Some examples feature a light smoked peat flavor. This style could be considered the Scottish version of an English-style barley wine. Overly smoked versions would be considered specialty examples.","https://www.craftbeer.com/styles/scotch-ale-wee-heavy","7a281d","Thistle"  ],
  ["British-Style Imperial Stout","Ale","British Origin Ales","7% - 12%","45-65 IBU","20-40 SRM","Tulip","50-55° F","Imperial Russian Stout-Courage, Imperial Extra Double Stout-Le Coq, Imperial Stout-Samuel Smith","Aged cheeses, Dark Chocolate Truffles, Raspberries","British-Style Imperial Stouts are dark copper to very dark. Hop aroma is very low to medium, with qualities such as floral, -citrus or -herbal. Extremely rich malty flavor, often characterized as toffee-like or caramel-like, is sometimes accompanied by very low (sometimes absent) roasted malt astringency.","https://beermaverick.com/beer-style/british-style-imperial-stout/","5c1012","Tulip"  ],
  ["British-Style Barley Wine Ale","Ale","British Origin Ales","8.5% - 12%","40-60 IBU","14-22 SRM","Snifter","50-55° F","Blithering Idiot-Weyerbacher Brewing Co., Old Stock Ale-North Coast Brewing Co., Barley Wine Ale-Dick's Brewing Co.","Moraccan Duck, English Stilton, Dark Chocolate","The name “British-style barley wine” represents a group of strong ales that rival the strength and complexity of some of the world’s most celebrated beverages. This brawny, malt-forward beer style is often one of the strongest beer styles on any given beer menu, and showcases a complex melange of toffee and fruit flavors counterbalanced by warming alcohol and sturdy hop bitterness. The barley wine beer style is a sipper, enjoyed responsibly, stylishly — preferably in front of a fire in a comfy chair amongst a plethora of leather-bound books.","https://www.craftbeer.com/styles/british-style-barley-wine-ale","8f3f1c","Snifter"  ],
  ["Brown Porter","Ale","British Origin Ales","4.5% - 6%","20-30 IBU","20-35 SRM","Nonic Pint","50-55° F","Old Tom Porter-Piney River Brewing Co., Pluff Mud Porter-Holy City Brewing Co., Porter-Back East Brewing Co.","Roasted or Grilled Meats, Gruyere, Chocolate Peanut Butter Cookies","The English-style brown porter has no roasted barley or strong burnt/black malt character. Low to medium malt sweetness, caramel and chocolate is acceptable. Hop bitterness is medium. Softer, sweeter and more caramel-like than a robust porter, with less alcohol and body. Porters are the precursor style to stouts.","https://www.craftbeer.com/styles/english-style-brown-porter","651613","Nonic"  ],
  ["Robust Porter","Ale","British Origin Ales","5.1% - 6.6%","25-40 IBU","30-40 SRM","Nonic Pint","50-55° F","Pig Iron Porter-Iron Hill Brewery & Restaurant, Moonlight Porter-Rock Bottom Restaurant & Brewery, Black Butte Porter-Deschutes Brewery","Roasted or Grilled Meats, Gruyere, Chocolate Peanut Butter Cookies","The Robust Porter features more bitter and roasted malt flavor than a brown porter, but not quite as much as a stout. Robust porters have a roast malt flavor, often reminiscent of cocoa, but no roast barley flavor. Their caramel and malty sweetness is in harmony with the sharp bitterness of black malt. Hop bitterness is evident. With U.S. craft brewers doing so much experimentation in beer styles and ingredients, the lines between certain stouts and porters are often blurred. Yet many deliberate examples of these styles do exist. Diacetyl is acceptable at very low levels.","https://www.craftbeer.com/styles/robust-porter","4b0c11","Nonic"  ],
  ["Sweet or Cream Stout","Ale","British Origin Ales","3.2% - 7%","15-35 IBU","25-40 SRM","Nonic Pint","50-55° F","Moozie-Brink Brewing, Oatmeal Milk Stout-Finkel & Garf Brewing, Milk Bone-Pinellas Ale Works","Dutch Gouda, roasted flavors, nuts","Sweet stouts, also referred to as cream stouts, have less roasted bitter flavor and a full-bodied mouthfeel. The style can be given more body with milk sugar before bottling. Malt sweetness, chocolate, and caramel flavor should dominate the flavor profile and contribute to the aroma Hops should balance and suppress some of the sweetness without contributing apparent flavor or aroma The overall impression should be sweet and full-bodied. ","http://beerinfo.com/top-10-cream-stouts/","530d11","Nonic"  ],
  ["Oatmeal Stout","Ale","British Origin Ales","3.8% - 6%","20-40 IBU","20-50 SRM","Nonic Pint","50-55° F","Stagecoach Stout-Figueroa Mountain Brewing Co., Back Road Stout-Millstream Brewing Co., Velvet Merlin-Firestone Walker Brewing Co.","Chicken in Mole Sauce, Aged Cheddar, Sweet Potato Cheesecake","The addition of oatmeal adds a smooth, rich body to the oatmeal stout. This beer style is dark brown to black in color. Roasted malt character is caramel-like and chocolate-like, and should be smooth and not bitter. Coffee-like roasted barley and malt aromas are prominent. This low- to medium-alcohol style is packed with darker malt flavors and a rich and oily body from oatmeal.","https://www.craftbeer.com/styles/english-style-oatmeal-stout","4b0c11","Nonic"  ],
  ["Double Red Ale","Ale","British Origin Ales","7% - 9%","25-40 IBU","10-20 SRM","Tulip","50-55° F","Double Red IPA-AleSmith Brewing Company, Nugget Nectar Ale-Tröegs, Former Tenant, Modus Operandi","Corned Beef hash, Mozzarella","A fairly complex Double IPA that pours a deep copper color with ruby highlights and a long-lasting tan head. The aroma greets the drinker with a prominent stone fruit hop aroma with hints of pineapple and a subtle bready and toasty maltiness with a light caramel character in the background.","https://beerandbrewing.com/make-your-best-west-coast-red-ale/","9d531f","Tulip"  ],
  ["Contemporary Gose","Ale","British Origin Ales","4% - 5.4%","5-15 IBU","3-9 SRM","Flute","40-50° F","Old Pro Gose-Union Craft Brewing, The Kimmie, The Yink & The Holy Gose-Anderson Valley Brewing Co., Gose- Westbrook Brewing Co.","Watermelon Salad, Queso Fresco, Greek Yogurt Lemon Mousse","Straw to medium amber, the contemporary Gose is cloudy from suspended yeast. A wide variety of herbal, spice, floral or fruity aromas other than found in traditional Leipzig-Style Gose are present, in harmony with other aromas. Salt (table salt) character is traditional in low amounts, but may be perceptible in varying intensities. Body is low to medium-low. Low to medium lactic acid character is evident in all examples as sharp, refreshing sourness.","https://www.craftbeer.com/styles/contemporary-gose","cfa200","Flute"  ],
  ["Baltic-Style Porter","Ale","British Origin Ales","7.6% - 9.3%","35-40 IBU","39-40 SRM","Nonic Pint","45-50° F","The Duck-Rabbit Baltic Porter-Duck Rabbit Craft Brewery, Smuttynose Baltic Porter-Smuttynose Brewing Company, Siberian Silk-La Cumbre Brewing Co.","Prime Rib, Aged Gouda, Deconstructed S'mores","The Baltic-style Porter is a smooth, cold-fermented and cold-lagered beer brewed with lager yeast. Because of its alcoholic strength, it may include very low to low complex alcohol flavors and/or lager fruitiness such as berries, grapes and plums (but not banana; ale-like fruitiness from warm-temperature fermentation is not appropriate). This style has the malt flavors of a brown porter and the roast of a schwarzbier, but is bigger in alcohol and body.","https://www.craftbeer.com/styles/baltic-style-porter","430c11","Nonic"  ],
  ["German-Style Kölsch / Köln-Style Kölsch","Ale","German Origin Ales","4.8% - 5.3%","18-28 IBU","3-6 SRM","Flute","40-45° F","Light of Cologne-Ornery Beer Co., Travelin' Light Kolsch-Left Hand Brewing Co., Summer Ale-Alaskan Brewing Co.","Bratwurst, Nutty Cheeses, Light Apircot Cake","Crisp, delicate and oh-so-drinkable, the German-style Kolsch is a beer hybrid, meaning that its production and subsequent beer drinking experience saddles qualities of both lager beers and ale beers. These light and refreshing ale-lager hybrids are perfect for warm summer days and have become a favored style by American craft brewers and beer lovers alike. In addition to their thirst quenching ability, they also are a fun beer to enjoy with food, including traditional German sausages and kraut.","https://www.craftbeer.com/styles/german-style-kolsch","d7b200","Flute"  ],
  ["Berliner-Style Weisse (Wheat)","Ale","German Origin Ales","2.8% - 3.4%","3-6 IBU","2-4 SRM","Goblet","45-50° F","Berliner Weisse-Nodding Head Brewery & Restaurant, Athena-Creature Comforts Brewing Co., Hottenroth Berliner Weisse-The Bruery","Aged Ham on Pretzel Bread, Havarti, Cheesecake with Raspberries","Low in alcohol, refreshingly tart, and often served with a flavored syrup like Woodruff or raspberry, the Berliner-style Weisse presents a harmony between yeast and lactic acid. These beers are very pale in color, and may be cloudy as they are often unfiltered. Hops are not a feature of this style, but these beers often do showcase esters. Traditional versions often showcase Brettanomyces yeast. Growing in popularity in the U.S., where many brewers are now adding traditional and exotic fruits to the recipe, resulting in flavorful finishes with striking, colorful hues. These beers are incredible when pairing. Bitterness, alcohol and residual sugar are very low, allowing the beer’s acidity, white bread and graham cracker malt flavors to shine. Carbonation is very high, adding to the refreshment factor this style delivers. Many examples of this style contain no hops and thus no bitterness at all.","https://www.craftbeer.com/styles/berliner-style-weisse","e1c336","Goblet"  ],
  ["Leipzig-Style Gose","Ale","German Origin Ales","4.4% - 5.4 %","5-15 IBU","2-7 SRM","Flute","40-50° F","Gose-Anderson Valley, Gose-Bayerisch Bahnhof Leipziger, Gose-Döllnitzer Ritterguts","Tilapia, Citurs, Peppers","These beers typically contain malted barley and unmalted wheat, with some versions also containing oats. Salt (table salt) and coriander may be present in low amounts or may be absent. Carbonation is high to very high. Effervescent.","https://beermaverick.com/beer-style/leipzig-style-gose/","d7b200","Flute"  ],
  ["South German-Style Hefeweizen / Hefeweissbier","Ale","German Origin Ales","4.9% - 5.6%","10-15 IBU","3-9 SRM","Vase","40-45° F","DreamWeaver Wheat-Troegs Brewing Co., Big Horn Hefeweizen-CB and Potts Restaurant & Brewery, Ebel's Weiss-Two Brothers Brewing Co.","Seafood, Chèvre, Key Lime Pie","Arguably one of the most recognizable beer styles, the German-style hefeweizen offers a striking beer experience thanks to the use of distinctive wheat malt, unique yeast and uncharateristic appearance. This wheat beer breaks from the German beer mold, showcasing yeast-driven fruit and spice as well as bearing an eye-catching mystique. Don’t let the cloudy hefeweizen deter you, this beer is one of the world’s most enjoyable styles for beer geeks and neophytes, alike. The refreshing qualities of this highly-carbonated style have kept it alive for centuries. Try one for yourself and experience why that is, firsthand.","https://www.craftbeer.com/styles/german-style-hefeweizen","cfa200","Vase"  ],
  ["South German-Style Kristall Weizen / Kristall Weissbier","Ale","German Origin Ales","4.3% - 5.6%","8-15 IBU","2-8 SRM","Vase","40-45° F","Laughing Fox-New Glarus, Citraizen-Jaws Brewery, Kristallweizenbock-Weihenstephaner","Salad, Roast Pork, Sasage, Ham, Sushi","You don’t have to be a German language expert to guess that Kristall mean a lighter colored beer, but it’s more than color, it’s the clarity you’ll really notice. Kristallweizen is simply a Hefeweizen that has been filtered. Most German wheat ales are not filtered and are hazy. Weizen yeast produce the banana and clove flavors and aromas in German wheat ales, but another characteristic of the yeast is low flocculation. Flocculation is a measurement of how much the yeast clump together and settle out of beer. High flocculating yeast cling together and fall out making clean, clear beers. Low flocculating yeast don’t fall out as much and produce hazy beers.","https://www.beermakesthree.com/2015/03/12/kristallweizen/","d4ac00","Vase"  ],
  ["German-Style Leichtes Weizen / Weissbier","Ale","German Origin Ales","2.5% - 3.5%","10-15 IBU","3-15 SRM","Vase","40-45° F","Light-Beck's, Leicht-Mahr's, Hell Leich-Paulaner Münchner","Buttery Cheeses, Seafood, Salads","These beers are made with at least 50 percent wheat malt. They are often roused during pouring, and when yeast is present, they will have a yeasty ﬂavor and a fuller mouthfeel.","https://beermaverick.com/beer-style/german-style-leichtes-weizen/","bd841a","Vase"  ],
  ["South German-Style Bernsteinfarbenes Weizen / Weissbier","Ale","German Origin Ales","4.8% - 5.4%","10-15 IBU","9-13 SRM","Vase","40-45° F","Bernsteinfarbenes Weizen-Wacker Brewing Co., Bernsteinfarbenes Weizen-Pedal Haus Brewery","Weisswurst and pretzels, roast chicken and pork","South German-Style Bernsteinfarbenes Weizen/Weissbiers are amber to light brown; the German word Bernsteinfarben means amber colored. If served with yeast appearance may appropriately be very cloudy. The phenolic and estery aromas typical of Weissbiers are more subdued in Bernsteinfarbenes Weissbier.","https://beermaverick.com/beer-style/south-german-style-bernsteinfarbenes-weizen/","b2731e","Vase"  ],
  ["South German-Style Dunkel Weizen / Dunkel Weissbier","Ale","German Origin Ales","4.8% - 5.4%","10-15 IBU","10-25 SRM","Vase","45-50° F","Samuel Adams Dunkelweizen-Boston Beer Co., Shiner Dunkelweizen-Spoetzl Brewery, Dunkle Weisse-Sierra Nevada / Ayinger","Roasted Chicken, Gouda, Banana Crème Pie","The German-style Dunkelweizen can be considered a cross between a German-style dunkel and a hefeweizen. Distinguished by its sweet maltiness and chocolate-like character, it can also have banana and clove (and occasionally vanilla or bubblegum) esters from weizen ale yeast.","https://www.craftbeer.com/styles/german-style-dunkelweizen","91421c","Vase"  ],
  ["South German-Style Weizenbock / Weissbock","Ale","German Origin Ales","7% - 9.5%","15-35 IBU","4.5-30 SRM","Tulip","45-55° F","Glockenspiel Weizenbock-Great Lakes Brewing Co., Moonglow-Victory Brewing Co., Weizenbock-AleSmith Brewing Co.","Chicken and Dumplings, Manchego, Banana Bread","The German-style Weizenbock is a wheat version of a German-style bock, or a bigger and beefier dunkelweizen. Malt mellanoidins and weizen ale yeast are the star ingredients. If served with yeast, the appearance may appropriately be very cloudy. With flavors of bready malt and dark fruits like plum, raisin, and grape, this style is low on bitterness and high on carbonation. Balanced clove-like phenols and fruity, banana-like esters produce a well-rounded aroma.","https://www.craftbeer.com/styles/german-style-weizenbock","92441c","Tulip"  ],
  ["Bamberg-Style Weiss (Smoke) Rauchbier (Dunkel or Helles)","Ale","German Origin Ales","4.9% - 5.6%","10-15 IBU","4-18 SRM","Tulip","45-55° F","Smoked Porter-Feral Brewing Co, Triomfbier Vooruit-Dupont Brewery, Eisenbahn Rauchbier-Eisenbahn","Grilled, and well seasoned protiens","","https://beermaverick.com/beer-style/bamberg-style-weiss-rauchbier/","b2731e","Tulip"  ],
  ["German-Style Altbier","Ale","German Origin Ales","4.6% - 5.6%","25-52 IBU","11-19 SRM","Tulip","45-50° F","Deep Roots-Red Cypress Brewery, Little Red Cap-Grimm Brothers Brewhouse, Alt-Southampton Public House","Grilled Salmon, Emmental, Apple Pie","Originally from the Düsseldorf area of Germany, the German-Style Altbier strikes a balance between hop and malt flavors and aromas, but can have low fruity esters and some peppery and floral hop aromas. Before Germany had lager beer, it had ales. Alt, meaning “old,” pays homage to one rebel region in Germany which did not lean into lagering. U.S. producers celebrate the ale revolution beautifully with this top-fermented German beer style.","https://www.craftbeer.com/styles/german-style-brownaltbier","9d531f","Tulip"  ],
  ["Kellerbier (Cellar beer) or Zwickelbier - Ale","Ale","German Origin Ales","4.8% - 5.4%","25-40 IBU","7-17 SRM","Tulip","40-45° F","Samuel Adams Alpine Lager-Boston Beer Company, KillaPilz-Voodoo Brewery, Sea To Sea Lager-Green Flash Brewing Co.","Steak, Venison, German Sausage, Shish Kebabs With Grilled Veggies","Kellerbier is a type of German beer, a lager, which is typically neither clarified nor pasteurised. The term Kellerbier literally translates as \"cellar beer\", referring to its cool lagering temperatures. Its recipe probably dates to the Middle Ages.","https://learn.kegerator.com/kellerbier/","ad6a20","Tulip"  ],
  ["Adambier","Ale","German Origin Ales","9% - 11%","30-50 IBU","15-35 SRM","Tulip","45-50° F","Hair of the dog-Adam from the Wood, Bishop's Barrel No. 17-Saint Arnold Brewing Co., Langst-Side Project Brewing","Salads, Seafood, Fruits, Truffles","The style originated in Dortmund and is a strong, dark, hoppy ale which may or may not be sour. It may also be extensively aged in wooden barrels. Traditional versions may have a low or medium-low degree of smokiness. Adambier may or may not use wheat in its formulation. Smoke character may be absent in contemporary versions. Fruited versions of this style which exhibit attributes of wood-aging should be categorized as fruited Wood- and Barrel-Aged Sour Beers. Fruited versions of this style which do not exhibit attributes of wood-aging should be categorized as Fruit Wheat Beers.","https://beermaverick.com/beer-style/adambier/","6f1d18","Tulip"  ],
  ["International-Style Pale Ale","Ale","International Ale Styles","4.4% - 6.6%","20-42 IBU","5-12 SRM","Nonic Pint","45-50° F","Lager-Windhoek, Premium Beer-Angkor, Lager-Atlas","Pastas, Cheeses","International-Style Pale Ales are gold to light brown. Chill haze is allowable at cold temperatures. Low caramel malt aroma is allowed. Hop aroma is absent to high. Very low to medium maltiness is present. Low caramel malt flavor is allowable. Hop flavor is very low to high, highlighted by a wide range of hop characters unlike those typical of fruity, floral, citrus-like or other American-variety characters, tropical fruity Australian varieties and/or earthy, herbal English-varieties. Hop bitterness is medium to high. Fruity-ester flavor and aroma should be low to high. Diacetyl should be absent or present at very low levels. DMS should not be present. Body is light to medium.","https://beerrecipes.org/AHA-Style/81/international-style-pale-ale.html","c08913","Nonic"  ],
  ["Australian-Style Pale Ale","Ale","International Ale Styles","3.5% - 5.2%","20-40 IBU","5-14 SRM","Tulip","45-50° F","Vale Ale-McLaren Vale, Pale Ale-Little Creatures, 28 Pale Ale-Burleigh Brewing Co.","Spicy Indian/Asian Dishes or traditional British Roasts","The Australian style of pale ale is harder to define than the well-established American, Indian and Belgian styles, all three of which also have their roots in British beer making. Pale ale was first brewed in England in the 18th century when coke - a processed form of coal that burns even and hot. - was found to provide more control over the malting process. The result was paler malts that produced clear amber or copper-coloured ales. By today's standards, pale ales aren't really pale but back in the day, they were a whole lot lighter than the dark ales people were drinking.","https://www.danmurphys.com.au/liquor-library/beer/styles/australian-pale-ale","bb801b","Tulip"  ],
  ["Irish-Style Red Ale","Ale","Irish Origin Ales","4 - 4.8%","20-28 IBU","11-18 SRM","Nonic Pint","45-55° F","St. James Irish Red Ale-Glenwood Canyon Brewpub, Conway's Irish Ale-Great Lakes Brewing Co., Brian Boru Old Irish Ale-Three Floyds Brewing","Roasted Vegetables, Cheddar, Poached Pears","The Irish-style red ale is a balanced beer that uses a moderate amount of kilned malts and roasted barley in the recipe, which gives the beer the color for which it is named. Featuring an approachable hop bitterness which rests on the palate, this typically amber-colored beer is brewed as a lager or an ale, and can often have a medium, candy-like caramel malt sweetness. This style may contain adjuncts such as corn, rice, and sugar, which help dry out the beer’s finish and lessen the body. It also often contains roasted barley, lending low roasted notes, darker color and possible creation of a tan collar of foam on top. With notes of caramel, toffee and sometimes low-level diacetyl (butter), think of the Irish red ale beer style as a cousin to lightly-toasted and buttered bread.","https://www.craftbeer.com/styles/irish-style-red","a0571f","Nonic"  ],
  ["Classic Irish-Style Dry Stout","Ale","Irish Origin Ales","3.8% - 5%","30-40 IBU","35-40 SRM","Nonic Pint","50-55° F","Blarney Sisters Dry Irish Stout-Third Street Aleworks, Seaside Stout-Pizza Port Brewing Co., O.V.L. Stout-Russian River Brewing Co.","Seafood (Oysters), Ham, Irish Cheddar, Chocolate Desserts","Dry stout is black beer with a dry-roasted character thanks to the use of roasted barley. The emphasis on coffee-like roasted barley and a moderate degree of roasted malt aromas define much of the character. Hop bitterness is medium to medium high. This beer is often dispensed via nitrogen gas taps that lend a smooth, creamy body to the palate.","https://www.craftbeer.com/styles/irish-style-dry-stout","430c11","Nonic"  ],
  ["Foreign (Export)-Style Stout","Ale","Irish Origin Ales","5.5% - 8%","30-70 IVU","30-40 SRM","Nonic Pint","50-55° F","Guinness Foreign Extra Stout-Guinness Ltd.","Seafood, Irish Cheddar, Chocolate Desserts","This special style stout started back with the 19th century, being developed in the year 1801 by Guiness, who initially named the beer, the West India Porter. He designed this beer specifically to be shipped to Irish expatriates that were working in the Caribbean at the time. In order to withstand the long trip from Ireland, the beer was brewed bigger with extra hops and more alcohol, which serve as natural preservatives. The beer later became known as the Foreign Extra Stout.","https://craftbeerclub.com/beer-style/foreign--export-stout#:~:text=Foreign%20Export%20Stouts%20range%20from,%2C%20roasted%20grains%2C%20and%20coffee.&text=Export%20Stouts%20have%20an%20ABV,%2C%20mug%2C%20or%20pint%20glass.","4b0c11","Nonic"  ],
  ["American-Style Pale Ale","Ale","North American Origin Ales","4.4% - 5.4%","30-50 IBU","6-14 SRM","Tulip","45-55° F","Stick's Pale Ale-Bootstrap Brewing Co., Pale Ale-Sierra Nevada, Mirror Pond-Deschutes Brewery","Roasted or Grilled Meats, Mild or Medium Cheddar, Apple Pie","Like many others that have become known as classic American beers, the American pale ale can trace its roots to beer styles from abroad. The American pale ale beer was inspired by the English pale ale, replacing its English counterpart’s earthy, herbal hops with generous additions of boldly citrus and pine-like American varieties. As one of the most popular American beer styles, pale ale beer is not hard to track down, but the various takes on this iconic style by just as many American craft brewers makes it impossible to jam everything there is to know about American pale ale beer on one page, but we’ll do our best.","https://www.craftbeer.com/styles/american-pale-ale","b87b1c","Tulip"  ],
  ["Fresh \"Wet\" Hop Ale","Ale","North American Origin Ales","5% - 7%","35-70 IBU","5-14 SRM","Nonic Pint","50-55° F","Fresh Hop Ale-Indeed Brewing Co., Mother's Harvest-Upland Brewing Co., Harvest Ale-Founders Brewing Co.","Steak, barbecue, and Mexican food.","Fresh hops produce a beer that is less bitter and has less of a bite to it, while adding more of a fresh, herbal or “green” flavor profile. The biggest difference is that fresh hops must be used within 24 hours of harvest or they will begin to rot.","https://www.thegrowlerguys.com/the-411-on-fresh-hop-beers/","bb801b","Nonic"  ],
  ["Pale American-Belgo-Style Ale","Ale","North American Origin Ales","Varies","Varies","5-15 SRM","Tulip","50-55° F","Rayon Vert-Green Flash, Raging Bitch-Flying Dog","Pretzels","Pale American-Belgo-Style Ales are gold to light brown. Chill haze may be evident. Fruity-ester aroma is medium to high. Hop aroma is medium to very high, exhibiting American type hop aromas not usually found in traditional Belgian styles. Hop flavor is medium to very high. Hop bitterness is medium to very high. Fruity-ester flavor should be medium to high.","https://beerrecipes.org/AHA-Style/34/pale-american-belgo-style-ale.html","b87b1c","Tulip"  ],
  ["Dark American-Belgo-Style Ale","Ale","North American Origin Ales","Varies","Varies","5-15 SRM","Tulip","50-55° F","","Pretzels","","","b87b1c","Tulip"  ],
  ["American-Style Strong Pale Ale","Ale","North American Origin Ales","5.6% - 7.3%","40-50 IBU","4-14 SRM","Nonic Pint","50-55° F","Zombie Dust-3 Floyds Brewing, Hop on Top-Lynnwood Brewing, Hubert MPA-Melvin Brewing","Mexican food, Spicy foods","American Strong Pale Ales are deep golden to copper. Chill haze is allowable at cold temperatures. Low caramel malt aroma is allowable. Fruity-ester aroma should be moderate to strong. Hop aroma is high, exhibiting floral, fruity, citrus-like, piney, resinous, or sulfur-like American-variety hop characters. Low level maltiness may include low caramel malt character. Hop flavor is high, exhibiting floral, fruity, citrus-like, piney, resinous, or sulfur-like American-variety hop flavors.","https://www.brewersassociation.org/edu/brewers-association-beer-style-guidelines/#29","bd841a","Nonic"  ],
  ["American-Style India Pale Ale","Ale","North American Origin Ales","6.3% - 7.5%","50-70 IBU","6-12 SRM","Tulip","50-55° F","Stone IPA-Stone Brewing Co., Two Hearted Ale-Bell's Brewery, Bodhizafa IPA-Georgetown Brewing Co.","Spicy Tuna Roll, Blue Cheeses, Persimmon Rice Pudding","Characterized by floral, fruity, citrus-like, piney or resinous American-variety hop character, the IPA beer style is all about hop flavor, aroma and bitterness. This has been the most-entered category at the Great American Beer Festival for more than a decade, and is the top-selling craft beer style in supermarkets and liquor stores across the U.S.","https://www.craftbeer.com/styles/american-india-pale-ale","bd841a","Tulip"  ],
  ["Imperial or Double India Pale Ale","Ale","North American Origin Ales","7.6% - 10.6%","65-100 IBU","2-9 SRM","Tulip","50-55° F","Hop JuJu-Fat Heads Brewery, 2x4-Melvin Brewing Co., Furious-Surly Brewing Co.","Bone-In Pork Chops, Miso Salmon, Rich Cheeses, Carrot Cake","American craft beer lovers are huge fans of the IPA. The quest for more of the India pale ale flavor has led them to the imperial India pale ale, a stronger version of the American IPA, which boasts even more hoppy flavor, aroma and bitterness. Imperial India pale ale is darker in color than the American IPA, substantially more bitter, and high in alcohol by volume. This all-American take on the IPA leaves craft beer fans with plenty of new creations to try.","https://www.craftbeer.com/styles/imperial-india-pale-ale","d1a700","Tulip"  ],
  ["American-Style Amber/Red Ale","Ale","North American Origin Ales","4.4% - 6.1%","25-45 IBU","11-18 SRM","Tulip","45-55° F","HopBack Amber-Troegs Brewing Co., Boont Amber-Anderson Valley Brewing Co., Red Seal-North Coast Brewing Co.","Barbecue, Medium Cheddar, Banana Pound Cake","Like most amber beers, American amber ale is named after the golden to amber color this American version of English pale ale exhibits. The color is derived from the use of caramel and crystal malt additions, which are roasted to provide amber beers with the color, body and flavor many beer fans have come to appreciate. Falling under the ale beer type, amber ales ferment at warmer temperatures for what is typically a much shorter amount of time than lager style beers.","https://www.craftbeer.com/styles/amber-ale","a0571f","Tulip"  ],
  ["Imperial Red Ale","Ale","North American Origin Ales","8% - 10.6%","55-85 IBU","10-17 SRM","Tulip","50-55° F","The Red Glove-Boxing Bear Brewing Co., Shark Attack Double Red Ale-Port Brewing Co., Paradocs Red Imperial IPA-Ninkasi Brewing","Corned Beef Hash, Mozzarella, Toffee Pudding","The use of American hops in the American imperial red ale lends to the perception of medium hop bitterness, flavor and aroma. Coupled with a solid malt profile, this should be a beer with balance between hop bitterness and malt sweetness. This is another example of modern American brewers taking an established style and boosting the flavor. California brewers are credited with creating this innovative style.","https://www.craftbeer.com/styles/american-imperial-red-ale","a55e21","Tulip"  ],
  ["American-Style Barley Wine Ale","Ale","North American Origin Ales","8.5% - 12.2%","60-100 IBU","11-18 SRM","Snifter","50-55° F","Bigfoot-Sierra Nevada Brewing Co., Old Numbskull-AleSmith Brewing Co., Toad Choker Barley Wine-Nine Band Brewing Co.","Beef Cheek, Strong Blue Cheeses, Rich Desserts","American barley wine ranges from amber to deep red/copper-garnet in color. A caramel and/or toffee aroma and flavor are often part of the malt character along with high residual malty sweetness. Complexity of alcohols is evident. Fruity-ester character is often high. As with many American versions of a style, this barley wine ale is typically more hop-forward and bitter than its U.K. counterpart. Low levels of age-induced oxidation can harmonize with other flavors and enhance the overall experience. Sometimes sold as vintage releases.","https://www.craftbeer.com/styles/american-barley-wine","a55e21","Snifter"  ],
  ["American-Style Wheat Wine Ale","Ale","North American Origin Ales","8.5% - 12.2%","45-85 IBU","5-15 SRM","Snifter","50-55° F","Wheat Wine-Smuttynose Brewing Co., Winter Wheat Wine-Rubicon Brewing Co., Wheat Wine-The Portsmouth Brewery","Smoked Trout, Asiago, Peach Sorbet","Part of the “strong ale” category, the American-Style Wheat Wine Ale is not derived from grapes as its name might suggest. Made with at least 50 percent wheat malt, this full-bodied beer features bready and candy flavors, and finishes with a great deal of malty sweetness. These beers may be oak-aged and sometimes have small amounts of darker malts added.","https://www.craftbeer.com/styles/american-style-wheat-wine-ale","b87b1c","Snifter"  ],
  ["Golden or Blonde Ale","Ale","North American Origin Ales","4.1% - 5.1%","15-25 IBU","3-7 SRM","Tulip","45-50° F","Summer Love Ale-Victory Brewing Co., Twilight Summer Ale-Deschutes Brewery, Kirby-Echo Brewing Co.","Spaghetti and Meatballs, Pepper Jack, Sugar Cookies","One of the most approachable styles, a golden or blonde ale is an easy-drinking beer that is visually appealing and has no particularly dominating malt or hop characteristics. Rounded and smooth, it is an American classic known for its simplicity. Sometimes referred to as “golden ale.” These beers can have honey, spices and fruit added, and may be fermented with lager or ale yeast.","https://www.craftbeer.com/styles/blonde-ale","d4ac00","Tulip"  ],
  ["American-Style Brown Ale","Ale","North American Origin Ales","4.2% - 6.3%","25-45 IBU","15-26 SRM","Nonic Pint","50-55° F","Brooklyn Brown Ale-Brooklyn Brewery, Settle Down Brown-Odell Brewing Co., Face Down Brown-Telluride Brewing Co.","Grilled Meats and Vegetables, Aged Gouda, Pear Fritters","Roasted malt, caramel-like and chocolate-like characters should be of medium intensity in both flavor and aroma for the American brown ale. American-style brown ales have evident low to medium hop flavor and aroma and medium to high hop bitterness. The history of this style dates back to U.S. homebrewers who were inspired by English-style brown ales and porters. It sits in flavor between those British styles and is more bitter than both.","https://www.craftbeer.com/styles/american-brown-ale","83311e","Nonic"  ],
  ["Smoke Porter","Ale","North American Origin Ales","5.1% - 8.9%","20-40 IBU","19-20 SRM","Nonic Pint","50-55° F","Smoked Porter-Alaskan Brewing Co., Smoked Porter-Stone Brewing Co., Smoked Porter-Epic Brewing Co.","Grilled Sausage, Red Dragon Cheddar, S'mores","Typically the base for the smoke porter beer style is a robust porter that is given smoky depth thanks to wood-smoked malt. Traditionally, brewers will cite the specific wood used to smoke the malt, and different woods will lend different flavors to the finished product. Smoke flavors dissipate over time.","https://www.craftbeer.com/styles/smoke-porter","88371d","Nonic"  ],
  ["American-Style Sour Ale","Ale","North American Origin Ales","Varies","Varies","1-40 SRM","Goblet","40-50° F","Ching Ching-Bend Brewing Co., Le Petite Prince-Jester King Brewery, Queen of Tarts-Karl Strauss Brewing Co.","Varies, Strongly Flavored Cheeses, Creamy Desserts with  Fruit","The acidity present in sour beer is usually in the form of lactic, acetic and other organic acids naturally developed with acidified malt in the mash, or produced during fermentation by the use of various microorganisms. These beers may derive their sour flavor from pure cultured forms of souring agents or from the influence of barrel aging.","https://www.craftbeer.com/styles/american-sour","83311e","Goblet"  ],
  ["American-Style Black Ale","Ale","North American Origin Ales","6% - 7.5%","50-70 IBU","34-38 SRM","Tulip","50-55° F","Wookey Jack-Firestone Walker Brewing Co., Back in Black-21st Amendment Brewery, Once You Go-Lynnwood Brewing Concern","Grilled Shrimp and Grits, Blue Cheeses, Aged Gouda, Chocolate Truffles","The American black ale is characterized by the perception of caramel malt and dark roasted malt flavor and aroma. Hop bitterness is perceived to be medium-high to high. Hop flavor and aroma are medium-high. Fruity, citrus, piney, floral and herbal character from hops of all origins may contribute to the overall experience. This beer is often called a black IPA or Cascadian dark ale.","https://www.craftbeer.com/styles/american-black-ale","470c11","Tulip"  ],
  ["American-Style Stout","Ale","North American Origin Ales","5.7% - 8.9%","34-60 IBU","40-45 SRM","Nonic Pint","50-55° F","Shakespeare Stout-Rogue Ales, Obsidian Stout-Deschutes Brewery, Black Cliffs-Boise Brewing","Grilled Lamb, Sharp Cheddar, Coffee Cake","American stout beer is perhaps one of the most identifiable creations of the American beer world. Stout beer is about as dark of an American beer as can be, and has a very noticeable of appearance, aroma and flavor. As one of the thicker, darker American beers on the craft beer scene, American stout beer is perfect for the colder seasons.","https://www.craftbeer.com/styles/american-stout","350c11","Nonic"  ],
  ["American-Style Imperial Stout","Ale","North American Origin Ales","7% - 12%","50-80 IBU","39-40 SRM","Snifter","50-55° F","Expedition Stout-Bell's Brewery, Old Rasputin Imperial Stout-North Coast Brewing Co., The Russian-2SP Brewing Co.","Foie Gras, Aged Cheeses, Flour-less Chocolate Cake","The American-style imperial stout is the strongest in alcohol and body of the stouts. Black in color, these beers typically have an extremely rich malty flavor and aroma with full, sweet malt character. Bitterness can come from roasted malts or hop additions.","https://www.craftbeer.com/styles/american-imperial-stout","3d0c11","Snifter"  ],
  ["Specialty Beers","Ale","North American Origin Ales","2.5% - 25%","1-100 IBU","Varies","Snifter","45-55° F","Chainbreaker White IPA-Deschutes Brewery, Sam Adams Norse Legend Sahti-Boston Beer Co., Campfire Stout-High Water Brewing","Varies","Ingredients used in the specialty beer style should be distinctive and evident in either the aroma, flavor or overall balance of the beer. This style category is a catch-all. Any specialty beer that does not fit other specialty beer styles would be appropriately considered here. Examples can include sahti, steinbier, white IPA, session IPA and more.","https://www.craftbeer.com/styles/specialty-beer","85341d","Snifter"  ],
  ["American-Style Imperial Porter","Ale","North American Origin Ales","7% - 12 %","35-50 IBU","39-40 SRM","Tulip","50-55° F","Northstar Imperial Porter-Twisted Pine Brewing Co., Imperial Porter-Long Trail Brewing Co., Imperial Porter-Shipyard Brewing Co.","Chicken Mole Enchiladas, Smoked Gouda, Blondie Butterscotch Brownies","Definitively American, the imperial porter should have no roasted barley flavors or strong burnt/black malt character. Medium caramel and cocoa-like sweetness is present, with complementing hop character and malt-derived sweetness.","https://www.craftbeer.com/styles/american-imperial-porter","3d0c11","Tulip"  ],
  ["Session India Pale Ale","Ale","North American Origin Ales","3% - 5%","40-70 IBU","6-14 SRM","Shaker Pint","45-55° F","Slightly Mighty-Dogfish Head Craft Brewery, Soundboard Session IPA-Destihl Brewery, Baby Giraffe-Civil Society Brewng Co.","Spicy Tuna Roll, Blue Cheeses, Persimmon Rice Pudding","The Session IPA is sub-style of the American IPA and received an official designation in 2010 in response to the growing trend of hoppier, low alcohol beers being brewed. This IPA retains the high bitterness of the standard IPA but has lower alcohol levels to make the brew “sessionable”. Even so, its strength can approach moderate levels. The Session IPA is less balanced than the American Pale Ale with higher attenuation and greater astringency.","https://absolutebeer.com/style/session-ipa/","b87b1c","Shaker"  ],
  ["German-Style Pilsner","Lager","European-Germanic Lager","4.6% - 5.3%","25-50 IBU","3-4 SRM","Flute","40-45° F","Pivo Pils-Firestone Walker Brewing Co., Paintbrush Pilsener-Snake River Brewing Co., Prima Pils-Victory Brewing Co.","Shellfish, Chicken, Salads, White Cheddar, Shortbread Cookies","Quite possibly the most iconic beer style in modern history, the pilsner captured the attention of beer drinkers across the world and inspired a myriad of regional imitations. This lightly colored, exquisitely balanced lager remains one of the most loved beers to enjoy, and one of the most challenging for the brewer to create. Pilsner are characteristically light in color and have a very short finish. The world over, pilsner -style lagers have become the standard beer for many reasons, and American craft brewers have worked hard to put their own unique spin on this classic German beer.","https://www.craftbeer.com/styles/german-style-pilsener","ddbd1b","Flute"  ],
  ["Bohemian-Style Pilsener","Lager","European-Germanic Lager","4.1% - 5.1%","30-45 IBU","3-7 SRM","Flute","40-45° F","Bohemian Pilsener-Ninkasi Brewing Co., Mama’s Little Yella Pils-Oskar Blues, Sweet Ride-Bagby Beer Co.","Shellfish, Chicken, Salads, Mild White Cheddar, Shortbread Cookies","The Bohemian pilsener has a slightly sweet and evident malt character and a toasted, biscuit-like, bready malt character. Hop bitterness is perceived as medium with a low to medium-low level of noble-type hop aroma and flavor. This style originated in 1842, with “pilsener” originally indicating an appellation in the Czech Republic. Classic examples of this style used to be conditioned in wooden tanks and had a less sharp hop bitterness despite the similar IBU ranges to German-style pilsner. Low-level diacetyl is acceptable. Bohemian-style pilseners are darker in color and higher in final gravity than their German counterparts.","https://www.craftbeer.com/styles/bohemian-style-pilsener","d4ac00","Flute"  ],
  ["German-Style Leichtbier","Lager","European-Germanic Lager","2.4% - 3.6%","15-28 IBU","2-5 SRM","Flute","40-45° F","Beck’s Light, Bitburger Light, Mahr’s Leicht, Paulaner Münchner Hell Leicht, Paulaner Premium Leicht","Moderately spiced Thai, Vietnamese and Indian dishes, Fish, shellfish, sushi, ham, smoked salmon, sausages, pizza, rich cream soups, chicken wings, and Goat cheese","German Leichtbier, pronounced LYESHT-beer, is the German version of the Light American Lager. It was made for the everyday common working man. In the BJCP Guidelines it is noted that a German Leichtbier is marked as a diet beer with lower carbohydrates, alcohol, and calories.","https://homebrewacademy.com/leichtbier-recipe/","ddbd1b","Flute"  ],
  ["Münchner (Munich)-Style Helles","Lager","European-Germanic Lager","3.8% - 4.4%","18-25 IBU","4-5 SRM","Tulip","40-45° F","Helheim Helles-Gemut Biergarten, Passing Place Hoppy Lager-Seventh Son Brewing Co., Sonnenschein-Water Street Brewing Co.","Salad or fresh shellfish, like clams.","A beer for beer lovers, the German-style helles is a malt accented lager beer that balances a pleasant malt sweetness and body with floral Noble hops and restrained bitterness. The German helles reminds beer lovers that the simple things in life are usually the most rewarding and worth pursuing.","https://www.brewersassociation.org/edu/brewers-association-beer-style-guidelines/#79","d7b200","Tulip"  ],
  ["Dortmunder / European-Style Export","Lager","European-Germanic Lager","5.1% - 6.1%","23-29 IBU","3-6 SRM","Flute","45-55° F","Dortmunder Gold-Great Lakes Brewing Co., Lager-Bell's Brewery Inc., Dortmunder Mifflin-Emmett's Tavern & Brewing Co.","Grilled Steak, Chèvre, Bread Pudding","Sometimes referred to as a “Dortmunder export,” the European-Style Export has the malt-forward flavor and sweetness of a German-style helles, but the bitter base of a German-style pilsener. This lager is all about balance, with medium hop character and firm but low malt sweetness. Look for toasted malt flavors and spicy floral hop aromas.","https://www.craftbeer.com/styles/european-style-export","d7b200","Flute"  ],
  ["Vienna-Style Lager","Lager","European-Germanic Lager","4.5% - 5.5%","22-28 IBU","12-16 SRM","Flute","45-50° F","Eliot Ness-Great Lakes Brewing Co., Vienna-Sierra Nevada Brewing Co., Vienna Lager-Chuckanut Brewery","Grilled Meats and Vegetables, Mild Cheeses, Almond Biscotti","Vienna Lager ranges from copper to reddish brown in color. The beer is characterized by malty aroma and slight malt sweetness. The malt aroma and flavor should have a notable degree of toasted and/or slightly roasted malt character. Hop bitterness is low to medium-low.","https://www.craftbeer.com/styles/vienna-style-lager","a35b20","Flute"  ],
  ["German-Style Märzen","Lager","European-Germanic Lager","5.1% - 6%","18-25 IBU","4-15 SRM","Flute","45-50° F","Rhinofest-Lost Rhino Brewing Co., Shiner Oktoberfest-Spoetzl Brewery, Festbier-Victory Brewing Co.","Kielbasa, Jalapeno Jack, Coconut Flan","A beer rich in malt with a balance of clean, hop bitterness, similar to the Vienna lager. Toasted bread or biscuit-like malt aroma and flavor is to be expected. Originating in Germany, this style was traditionally brewed in the spring (“Marzen” meaning “March”) and aged, or lagered, throughout the summer. A stronger version was served at early Oktoberfest celebrations and became known as Oktoberfest. Today, the festival’s version of an Oktoberfest is quite a bit lighter than what American craft brewers consider an Oktoberfest.","https://www.craftbeer.com/styles/german-style-marzen-oktoberfest","bb801b","Flute"  ],
  ["German-Style Oktoberfest / Wiesen (Meadow)","Lager","European-Germanic Lager","Listed like marzen","","","","","","","","","pink","Varies"  ],
  ["European-Style Dark / Münchner Dunkel","Lager","European-Germanic Lager","4.8% - 5.3%","16-25 IBU","15-17 SRM","Vase","45-50° F","Moondoor Dunkel-Wibby Brewing, Knight Ryder Munich Dunkel-Equinox Brewing, Dunkel-Chuckanut Brewery","Sausages, Roasted Vegetables, Washed-Rind Munster, Candied Ginger Beer Cake","The German-style dunkel is a bottom-fermented lager style beer. The word “dunkel” is German for “dark,” and this dark beer style offers beer lovers balanced flavors of chocolate, bread crust and caramel. The dunkel is a classic German lager that craft brewers are fond of brewing and countless people across the world are fond of enjoying. Like most German beers, dunkel beer is a great candidate for food pairing, matching up well to grilled meats.","https://www.craftbeer.com/styles/german-style-dunkel","984c1d","Vase"  ],
  ["German-Style Schwarzbier","Lager","European-Germanic Lager","3.8% - 4.9%","22-30 IBU","25-30 SRM","Flute","45-50° F","DTB Schwarzbier-Desperate Times Brewery, Black Bavarian-Sprecher Brewing Co., Sam Adams Black Lager-Boston Beer","Mushroom Strudel, Munster-Style Cheese, Fruit Tart","Sometimes called black lagers, they may remind some of German-style dunkels, but schwarzbiers are drier, darker and more roast-oriented.These very dark brown to black beers have a surprisingly pale-colored foam head (not excessively brown) with good cling quality. They have a mild roasted malt character without the associated bitterness. Malt flavor and aroma is at low to medium levels of sweetness.","https://www.craftbeer.com/styles/german-style-schwarzbier","651613","Flute"  ],
  ["Bamberg-Style Märzen Rauchbier","Lager","European-Germanic Lager","5.1% - 6%","18-25 IBU","4-15 SRM","Snifter","45-50° F","Captain Jacks Smoked Spruce Pale Ale-Kingdom Brewing, Fort Hill Rauchbier-Fort Hill Brewery, Hood's Head Smoked Amber-Hood Canal Brewery","","Smoked beer (German: Rauchbier) is a type of beer with a distinctive smoke flavour imparted by using malted barley dried over an open flame.","https://beermaverick.com/beer-style/bamberg-style-maerzen-rauchbier/","bb801b","Snifter"  ],
  ["Bamberg-Style Helles Rauchbier","Lager","European-Germanic Lager","3.8% - 4.4%","18-25 IBU","4-6 SRM","Flute","45-50° F","Helles Lagerbier-Brauerei Heller-Trum / Schlenkerla, Helles Rauchbier-Waypost Brewing","Grilled brätwurst rubbed with spices, creamy cheeses, whole grain mustard","Bamberg-Style Helles Rauchbiers are light pale to golden. Chill haze should not be perceived. This is a malt-emphasized beer, with malt aromas reminiscent of freshly and very lightly toasted sweet malted barley present.","https://beerrecipes.org/AHA-Style/94/bamberg-style-helles-rauchbier.html#:~:text=Bamberg%2DStyle%20Helles%20Rauchbiers%20are,toasted%20sweet%20malted%20barley%20present.","d4ac00","Flute"  ],
  ["Bamberg-Style Bock Rauchbier","Lager","European-Germanic Lager","4.8% - 6%","20-30 IBU","12-22 SRM","Vase","50-55° F","Smokebeer-Schlenkerla","Grilled Meats, Blue Cheeses, Cheddars, S'mores, Bread pudding, Gingerbread","A full bodied smoked bock beer for Bamberg's strong beer season (October through December) in fall. Brewed already in the summer time, it is matured for months in the ancient Schlenkerla rock-cellars underneath Bamberg. Tapped freshly from the oakwood cask and the Schlenkerla brewery pub. Similar to, but much bigger than the classic Maerzen style.","https://learn.kegerator.com/rauchbier/","94461c","Vase"  ],
  ["Traditional German-Style Bock","Lager","European-Germanic Lager","6.3% - 7.5%","20-30 IBU","20-30 SRM","Tulip","45-50° F","Troegenator Double Bock-Troegs Brewing Co., Butt Head Bock-Tommyknocker Brewery & Pub, Rockefeller Bock-Great Lakes Brewing Co.","Grilled Rib-Eye, Aged Swiss, Chocolate","Traditional bock beers are all-malt brews and are high in malt sweetness. Malt character should be a balance of sweetness and toasted or nut-like malt. “Bock” translates as “goat”!","https://www.craftbeer.com/styles/german-style-bock","6f1d18","Tulip"  ],
  ["German-Style Heller Bock/Maibock","Lager","European-Germanic Lager","6% - 8%","20-38 IBU","4-9 SRM","Goblet","45-55° F","Elixir Maibock-Abita Brewery, Maibock-Mad Fox Brewing Co., Maibock-Smuttynose Brewing Co.","Ham, Swiss, White Chocolate Cheesecake","Also called “heller bock” (meaning “pale bock”), the German-style Maibock is paler in color and more hop-centric than traditional bock beers. A lightly toasted and/or bready malt character is often evident.","https://www.craftbeer.com/styles/german-style-heller-bock-maibock","cc9d00","Goblet"  ],
  ["German-Style Eisbock","Lager","European-Germanic Lager","9% - 14%","25-35 IBU","18-30 SRM","Snifter","55-60° F","Aventinus Eisbock-G. Schneider & Sohn, Kulmbacher Eisbock-Kulmbacher Brauerei, Raspberry and Blueberry Eisbocks-Kuhnhenn Brewing Company","Game meats, venison, pork, smoked duck, slow-roasted peasant; Aged Gouda or Limburger cheese; German chocolate cake, creme brulee.","Eisbock is the summit of the bock beers. It is the strongest rendition of the bock tune; the first mysterious verses of which were hummed back in the 1300s in the town of Einbeck. From these first strains the music spread taking on different subtle notes along the way bringing to the world a series of songs all firmly sequestered within the framework of that earliest music; Traditional bock/Dunkles bock, Maibock/Helles bock, Doppelbock, and Eisbock.","https://learn.kegerator.com/eisbock/","8a391d","Snifter"  ],
  ["Kellerbier (Cellar beer) or Zwickelbier - Amber","Lager","European-Germanic Lager","4.8% - 5.4%","25-40 IBU","7-17 SRM","German Stein","40-45° F","Baumgartner Junghopfenpils-Brauerei Jos. Baumgartner, Ulmer Hexensud-Familienbrauerei Bauhoefer, Pilsner-Marble Brewing Company","Steak, Venison, German Sausage, Shish Kebabs With Grilled Veggies, Jalapeño Jack & Limburger Cheese, Nutty or Smooth Desserts.","Kellerbier is a pretty obscure style. It is a version of German lager originating in Franconia, Bavaria and dates to the very beginnings of lagering in the latter half of the Middle Ages. Lacking any type of refrigeration technology, brewer’s would brew their beer during the cool months of the year and then lager them in caves. These caves acted like natural cellars allowing the beer to remain at stable, cool temperature for the length of their slow maturation.","https://learn.kegerator.com/kellerbier/","ad6a20","GermanStein"  ],
  ["Kellerbier (Cellar beer) or Zwickelbier - Pale","Lager","European-Germanic Lager","4.7% - 5.4%","20-35 IBU","3-7 SRM","German Stein","40-45° F","Baumgartner Junghopfenpils-Brauerei Jos. Baumgartner, Ulmer Hexensud-Familienbrauerei Bauhoefer, Pilsner-Marble Brewing Company","Chicken Sandwich with Cilantro; Tex-Mex, Indian or Thai dishes; Light Seafood Dishes; Sharp Cheddar & Gruyere Cheese; Short Bread & Rice Pudding.","Kellerbier is a pretty obscure style. It is a version of German lager originating in Franconia, Bavaria and dates to the very beginnings of lagering in the latter half of the Middle Ages. Lacking any type of refrigeration technology, brewer’s would brew their beer during the cool months of the year and then lager them in caves. These caves acted like natural cellars allowing the beer to remain at stable, cool temperature for the length of their slow maturation.","https://learn.kegerator.com/kellerbier/","d4ac00","GermanStein"  ],
  ["American Brett Beer","","Hybrid/mixed Beer","Varies","Varies","Varies","Tulip","45-55° F","Touch of Brett-Alesong Brewing & Blending, Sanctification-Russian River Brewing Company, Brett Saison-Ardent Craft Ales","Grilled or Roasted Game, Earthy Farmhouse Cheeses, Fruit-Filled Pastries","These unique beers vary in color and can take on the hues of added fruits or other ingredients. Horsey, goaty, leathery, phenolic and some fruity acidic character derived from Brettanomyces organisms may be evident, but in balance with other components of an American Brett beer. Brett beer and sour beer are not synonymous. Despite Brettanomyces presents in sour beer, American Bret beers do not exhibit the level of sour taste that sour beers do, thus, Brett beers should not be mistaken for a sour beer.","https://www.craftbeer.com/styles/american-brett","85341d","Tulip"  ],
  ["Session Beer","","Hybrid/mixed Beer","3.5% - 5%","10-35 IBU","2-100 SRM","Varies","Varies","Provo Girl-Utah Brewers Co-op, Twerp-Pizza Port Brewing Co., PSB Session IPL-Perry Street Brewing Co.","Varies","Session beer is not defined by flavors or aromas, which can place it in almost any style category. Instead, what makes a session beer is primarily refreshment and drinkability. Any style of beer can be made lower in strength than described in the classic style guidelines. The goal should be to reach a balance between the style’s character and the lower alcohol content. Drinkability is a factor in the overall balance of these beers. Beer should not exceed 5 percent ABV.","https://www.craftbeer.com/styles/session-beer","240c11","Varies"  ],
  ["American-Style Cream Ale or Lager","","Hybrid/mixed Beer","4.3% - 5.7%","10-22 IBU","2-5 SRM","Flute","40-45° F","El Sully-21st Amendment Brewery, Spotted Cow-New Glarus Brewing Co., Broadway Light-Detroit Beer Co.","Salads, Mild Shellfish, Monterey Jack, Lemon Custard Tart","The American cream ale is a mild, pale, light-bodied ale, made using a warm fermentation (top or bottom fermenting yeast) and cold lagering. Despite being called an ale, when being judged in competitions it is acceptable for brewers to use lager yeast.","https://www.craftbeer.com/styles/american-cream-ale","ddbd1b","Flute"  ],
  ["California Common Beer","","Hybrid/mixed Beer","4.6% - 5.7%","35-45 IBU","8-15 SRM","Nonic Pint","50-55° F","Wagon Party-Bauhaus Brew Labs, 2x Steam-Southern Tier Brewing Co., Steam Engine Lager-Steamworks Brewing Co.","Pork Loin, Feta, Bread Pudding","The California common is brewed with lager yeast but fermented at ale fermentation temperatures. There is a noticeable degree of toasted malt and/or caramel-like malt character in flavor and often in aroma. Often referred to as “steam beer” and made famous by San Francisco’s Anchor Brewing Company. Seek out woody and mint flavor from the Northern Brewer hops.","https://www.craftbeer.com/styles/california-common","b06e1f","Nonic"  ],
  ["Ginjo Beer or Sake-Yeast Beer","","Hybrid/mixed Beer","4.3% -10.2%","12-35 IBU","4-20 SRM","Varies","50-55° F","Vieille Artisanal(Happy Leaf Lemongrass Mint)-Crooked Stave, Raising San-Sahtipaja","Sushi, Sashimi","Ginjo Beer was created to give beer lovers a hybrid lager beer that was brewed with local Calrose rice steamed using techniques from sake production instead of flaked rice traditionally used in commercial lagers.","https://www.newswire.com/news/ginjo7-lager-release-craft-beer-made-with-imported-sake-yeast-from-21156773#:~:text=From%20the%20collaboration%20of%20beer,traditionally%20used%20in%20commercial%20lagers.","ad6a20","Varies"  ],
  ["Light American Wheat Ale or Lager","","Hybrid/mixed Beer","3.5 % - 5.6%","10-35 IBU","2-10 SRM","Flute","40-45° F","Whacked Out Wheat-Telluride Brewing Co., Oberon-Bell's Brewery Inc., Tumblewheat-Altitude Chophouse and Brewery","Salads, Seafood, Chèvre, Fruit Desserts","American wheat beers are some of the most approachable beers in the craft beer world, and the versatility of wheat beer allows it to be combined with a variety of ingredients or enjoyed on its own alongside a wide variety of food options. The sizable portion of wheat malt used to brew wheat beer lends a lighter, distinctive experience compared to beers brewed with barley exclusively.","https://www.craftbeer.com/styles/american-wheat","cfa200","Flute"  ],
  ["Fruit Wheat Ale or Lager with or without Yeast","","Hybrid/mixed Beer","","","","","","","","To be filled","","pink","Varies"  ],
  ["Dark American Wheat Ale or Lager with Yeast","","Hybrid/mixed Beer","","","","","","","","To be filled","","pink","Varies"  ],
  ["Rye Ale or Lager","","Hybrid/mixed Beer","Varies","Varies","1-40 SRM","Vase","45-55° F","LowRYEder-SweetWater Brewing Co., Hoss-Great Divide Brewing Co., Breakside Rye Curious?-Breakside Brewery","Jerk Chicken, Wensleydale cheese, Savory Bread Pudding","In darker versions, malt flavor can optionally include low roasted malt characters (evident as cocoa/chocolate or caramel) and/or aromatic toffee-like, caramel, or biscuit-like characters. Low-level roasted malt astringency is acceptable when balanced with low to medium malt sweetness. Hop flavor is low to medium-high. Hop bitterness is low to medium. These beers can be made using either ale or lager yeast. The addition of rye to a beer can add a spicy or pumpernickel character to the flavor and finish. Color can also be enhanced and may become more red from the use of rye. The ingredient has come into vogue in recent years in everything from stouts to lagers, but is especially popular with craft brewers in India pale ales. To be considered an example of the style, the grain bill should include sufficient rye such that rye character is evident in the beer.","https://www.craftbeer.com/styles/rye-beer","85341d","Vase"  ],
  ["German-Style Rye Ale (Roggenbier)","","Hybrid/mixed Beer","5% - 6%","10-20 IBU","2-8 SRM","Nonic Pint","45-55° F","Norns Roggenbier-FATE Brewing Co., Roggenbier-Bear Republic Brewing Co., Live Oak Roggenbier-Live Oak Brewing Co.   ","Light Salad, Goat Cheeses, Ricotta Pasta, Banana cake","Roggenbier, which literally translates to ‘rye beer’, is typically made up of at least 50 percent malted rye, though there are modern examples using 65 percent or more. That lends it a characteristic grainy and spicy flavor. Bitterness is usually low, and you’ll most likely detect classic weizen yeast characters of tart citrus, vanilla or bubblegum.","https://www.craftbeer.com/craft-beer-muses/roggenbier-return-rye","d4ac00","Nonic"  ],
  ["Fruit & Field Beer","","Hybrid/mixed Beer","2.5% - 12%","5-45 IBU","5-50 SRM","Tulip","Varies","Apricot Cream Ale-Vertigo Brewing, Ruby Raspberry Wheat-Mad Anthony Brewing Co., Elektrik Cukumbah-Trinity Brewing Co.","Salads, Creamy Cheeses, Vanilla Ice Cream","Fruit beer is made with fruit, or fruit extracts that are added during any portion of the brewing process, providing obvious yet harmonious fruit qualities. This idea is expanded to “field beers” that utilize vegetables and herbs.","https://www.craftbeer.com/styles/fruit-field-or-flavored","651613","Tulip"  ],
  ["Pumpkin Beer","","Hybrid/mixed Beer","2.3% - 12%","5-70 IBU","5-50 SRM","Tulip","50-55° F","Pump Action Imperial Pumpkin Ale-4 Noses Brewing Co., Pumking-Southern Tier Brewing Co., Punkin-Dogfish Head Craft Brewery","Roasted Turkey, Camembert Cheese, Coffee Ice Crem","Nothing says fall quite like pumpkins and beer, and American craft breweries have done a superb job of combining the two. It’s tough to find anything that hasn’t been “pumpkin spiced,” and beers are no different. Pumpkin flavored beers have caught the attention of craft beer and pumpkin lovers everywhere, partially because the flavors can be implemented in several beer styles. Whether you’re interested in trying pumpkin amber ales, IPAs or pumpkin stouts, there are plenty of options from American craft brewers for you to explore.","https://www.craftbeer.com/styles/pumpkin-beers","651613","Tulip"  ],
  ["Chocolate / Cocoa-Flavored Beer","","Hybrid/mixed Beer","2.5 % - 12%","15-40 IBU","12-50 SRM","Snifter","50-55° F","Chocolate Oak Aged Imperial Yeti Stout-Great Divide Brewing Co., Brooklyn Black Chocolate Stout-Brooklyn Brewery, The Ticket Chocolate Beer-ZwanzigZ Brewing","Venison Mole, Aged Goat Cheeses, Raspberry Torte","Few flavors are as universally celebrated as chocolate. From ancient civilizations who drank fermented chocolate to rich, decadent and refined chocolate desserts, the cultural significance of chocolate cannot be understated. Like chocolate, beer too is a celebrated, versatile tradition that spans the globe. American craft brewers have embraced the combination of both with a variety of different approaches and applications to create chocolate flavored beers. While many beers showcase chocolatey flavors without actually having chocolate as an ingredient, chocolate beers use the ingredient itself to offer a uniquely balanced beer experience that can be appreciated by beer connoisseurs and those with sweet tooths alike.","https://www.craftbeer.com/styles/chocolate-beer","5c1012","Snifter"  ],
  ["Coffee-Flavored Beer","","Hybrid/mixed Beer","2.5% - 12%","15-45 IBU","4-50 SRM","Nonic Pint","50-55° F","Big Bad Baptist-Epic Brewing Co., Speedway Stout-AleSmith Brewing Co., Gusto Crema, Georgetown Brewing Co.","Pork Tenderloin, Aged Semi-Hard Cheeses, Vanilla Ice Cream","If you had to combine two beverages that Americans love, you would have coffee beer. Craft breweries across the United States have zealously embraced coffee flavored beer. The creations that have resulted from experimenting with the combination of some of the oldest beverages in the world have caught the attention of craft beer lovers everywhere.","https://www.craftbeer.com/styles/coffee-beer","671714","Nonic"  ],
  ["Herb and Spice Beer","","Hybrid/mixed Beer","2.5% - 12%","5-40 IBU","5-50 SRM","Tulip","45-55° F","NoDajito-NoDa Brewing Co., Midas Touch-Dogfish Head Brewing Co., Good Juju-Left Hand Brewing Co.","Varies","An herb and spice beer is a lager or ale that contains flavors derived from flowers, roots, seeds or certain fruits or vegetables. Typically the hop character is low, allowing the added ingredient to shine through. The appearance, mouthfeel and aromas vary depending on the herb or spice used. This beer style encompasses innovative examples as well as traditional holiday and winter ales.","https://www.craftbeer.com/styles/herb-and-spice-beer","651613","Tulip"  ],
  ["Specialty Beer","","Hybrid/mixed Beer","2.5% - 25%","1-100 IBU","Varies","Snifter","45-55° F","Chainbreaker White IPA-Deschutes Brewery, Sam Adams Norse Legend Sahti-Boston Beer Co., Campfire Stout-High Water Brewing","Varies","Ingredients used in the specialty beer style should be distinctive and evident in either the aroma, flavor or overall balance of the beer. This style category is a catch-all. Any specialty beer that does not fit other specialty beer styles would be appropriately considered here. Examples can include sahti, steinbier, white IPA, session IPA and more.","https://www.craftbeer.com/styles/specialty-beer","pink","Snifter"  ],
  ["Specialty Honey Lager or Ale","","Hybrid/mixed Beer","2.5% - 12%","1-100 IBU","1-50 SRM","Tulip","50-55° F","Jetty Cream Ale-Great South Bay Brewery, Westbound Braggot-Twisted Pine Brewing Co., Midas Touch-Dogfish Head Craft Brewery","Bruschetta, Ricotta, Lemon Basil Gelato","Both lagers and ales can be brewed with honey. Some brewers will choose to experiment with ingredients, while others will add honey to traditional styles. Overall the character of honey should be evident but not totally overwhelming. A wide variety of honey beers are available. U.S. brewers may add honey to the boil kettle (as a sugar source) or post-boil (to preserve more volatile aromatics).","https://www.craftbeer.com/styles/honey-beer","6b1a16","Tulip"  ],
  ["Gluten-Free Beer","","Hybrid/mixed Beer","Varies","Varies","1-40 SRM","Flute","Varies","Gluten Free-Deschutes Brewing Co., Nikki's Gluten Free Honey Pale Ale-Rock Bottom Restaurant & Brewery, Copperhead-Greenview Brewing","Varies","If you are one of the 2 million Americans who suffer from celiac disease, trying craft beers may seem impossible, or at least challenging. But with the growing interest in gluten-free options, many people have found that they no longer have to miss out on enjoying craft beer. Many brewers have recognized the desire for gluten-free customers to enjoy their beer without the concern of ingesting gluten, leading many craft brewers to utilize alternative grains during the brewing process that do not contain gluten. Dedicated gluten-free breweries have also found success catering to people dealing with gluten intolerance as well as health-minded beer drinkers who choose to follow a gluten-reduced or gluten-free diet, but don’t want to give up their favorite beverage.","https://www.craftbeer.com/styles/gluten-free","85341d","Flute"  ],
  ["Indigenous Beer (Lager or Ale)","","Hybrid/mixed Beer","","","","","","","","To be filled","","pink","Varies"  ],
  ["Smoke Beer (Lager or Ale)","","Hybrid/mixed Beer","Varies","Varies","Varies","Nonic Pint","45-55° F","Smoke Jumper Smoked Imperial Porter-Left Hand Brewing Co., Scarlet Fire-Victory Brewing Co., Raucher-Wolverine State Brewing Co.","Grilled Vegetables, Parmesan, Gingerbread Cookies","When malt is kilned over an open flame, the smoke flavor becomes infused into the beer, leaving a taste that can vary from dense campfire, to slight wisps of smoke. Any style of beer can be smoked; the goal is to reach a balance between the style’s character and the smoky properties. Originating in Germany as rauchbier, this style is open to interpretation by U.S. craft brewers. Classic base styles include German-style Marzen/Oktoberfest, German-style bock, German-style dunkel, Vienna-style lager and more. Smoke flavors dissipate over time.","https://www.craftbeer.com/styles/smoke-beer","pink","Nonic"  ],
  ["Experimental Beer (Lager or Ale)","","Hybrid/mixed Beer","Varies","Varies","Varies","Varies","Varies","Bitches Brew-Dogfish Head Brewery, Triple Bock-Boston Beer Co., Backstage-Founders Brewing Co.","Varies","Experimental beer is beer that is produced in or as a new style, using a new recipe, or as a type of beer that does not fit within present beer style criteria or definitions. The term also encompasses minor beer styles that are not covered under any of the Beer Judge Certification Program (BJCP) categories, with the exception of Belgian beers. Such minor beer styles may serve \"as an incubator\" for new potential categories, and may attain an official category if the style becomes of interest to the general public at a sufficient level. The Great American Beer Festival has an experimental beer category as a part of its competition, for which awards are given, as does the World Beer Cup, which also provides awards for beers in this category. The Oregon State Fair has a home brew competition that includes a category for specialty and experimental beers.","https://en.wikipedia.org/wiki/Experimental_beer","pink","Varies"  ],
  ["Historical Beer","","Hybrid/mixed Beer","","","","","","","","To be filled","","pink","Varies"  ],
  ["Wood- and Barrel-Aged Beer","","Hybrid/mixed Beer","Varies","Varies","1-40 SRM","Tulip","50-55° F","Drama Queen-Denver Beer Co., Barrel Aged Sump Coffee Stout-Perennial Beer Co., DBA-Firestone Walker Brewing Co.","Varies","A wood- or barrel-aged beer is any lager, ale or hybrid beer, either a traditional style or a unique experimental beer, that has been aged for a period of time in a wooden barrel or in contact with wood. This beer is aged with the intention of imparting the unique character of the wood and/or the flavor of what has previously been in the barrel. Beer may be aged in wooden barrels (new or previously used to age wine or spirits), or chips, spirals and cubes may be added to the conditioning tanks that normally house beer. A variety of types of wood are used including oak, apple, alder, hickory and more. The interior of most barrels is charred or toasted to further enhance the flavor of the wood.","https://www.craftbeer.com/styles/barrel-aged-beer","85341d","Tulip"  ],
  ["Non-Alcoholic (Beer) Malt Beverages","","Hybrid/mixed Beer",".05% - .5%","Varies","Varies","Varies","Varies","Special Effects-Brooklyn Brewery, Run Wild IPA-Athletic Brewing, Heineken 0.0-Heineken","Varies","Low-alcohol beer is beer with little or no alcohol content and aims to reproduce the taste of beer while eliminating (or at least reducing) the inebriating effects of standard alcoholic brews. Most low-alcohol beers are lagers, but there are some low-alcohol ales. Low-alcohol beer is also known as light beer, non-alcoholic beer, small beer, small ale, or near-beer.","https://en.wikipedia.org/wiki/Low-alcohol_beer","pink","Varies"  ],
  ["Belgian-style Fruit Beer","","Hybrid/mixed Beer","","","","","","","","To be filled","","pink","Varies"  ],
  ["Chili Pepper Beer","","Hybrid/mixed Beer","2.3% - 12%","Varies","Varies","Varies","Varies","Smoked Porter with Chipotle Peppers-Stone Brewing, Habanero Sculpin-Ballast Point Brewing Co., Lips of Faith Cocoa Molé Ale-New Belgium Brewing Co. ","Chocolate","In short, Hot & Spicy (Picante) or “Chili-Infused” beers are heat-forward and spicy and often that flavour can be so strong it overpowers the standard beer flavours (which is why this type of beer gets its own classification even though the underlying beer may be a pale ale, stout, porter or some other beer style).","https://justbeerapp.com/article/what-are-hot-spicy-picante-chili-infused-beers","pink","Varies"  ],
  ["Mixed Culture Brett Beer","","Hybrid/mixed Beer","Varies","Varies","Varies","Varies","Varies","Eukaryote-Creature Comforts, Do You Remember The Time?-Mikerphone Brewing, Rustic Sunday-Birds fly south","Varies","Fruited versions will exhibit fruit ﬂavors in balance with other elements. Wood vessels may be used for fermentation and aging, but wood-derived aromas and ﬂavors such as vanillin should not be present. Versions exhibiting attributes derived from wood or liquids previously aged in wood are categorized in Wood-Aged Beer categories. Sour wood- and barrel-aged versions are categorized in Wood-Aged Sour Beer categories. ","https://beermaverick.com/beer-style/mixed-culture-brett-beer/","pink","Varies"  ],
  ["Wild Beer","","Hybrid/mixed Beer","6% - 10%","5-30 IBU","8-17 SRM","Tulip","40-55° F","The Wild Beer Co.","Varies","Sometimes Belgian influenced, American Wild Ales are beers that are introduced to \"wild\" yeast or bacteria, such as Brettanomyces (Brettanomyces Bruxellensis, Brettanomyces Lambicus or Brettanomyces Anomolus), Pediococcus, or Lactobacillus. This introduction may occur from oak barrels that have been previously inoculated, pitching into the beer, or gained from various \"sour mash\" techniques. Regardless of the method, these yeast and/or bacteria leave a mark that should be noticeable to strong, and often contribute a sour and/or funky, wild note. Mixed-fermentation examples will display a range of aromatics, rather than a single dominant character.","https://www.beeradvocate.com/beer/styles/171/","aa6621","Tulip"  ],
  ["International-Style Pilsener","","International Styles","4.6% - 5.3%","17-30 IBU","3-4 SRM","Flute","40-55° F","Premium Pils-Paulaner, Pilsner-Weihenstephaner, CD-Pils-Dinkel Acker","Grana Padano or aged Parmesan, Chicken Pesto with Pasta","These beers are often brewed with rice, corn, wheat, or other grains. Sugar adjuncts may also be used.","https://beermaverick.com/beer-style/international-style-pilsener/","ddbd1b","Flute"  ],
  ["Dry Lager","","International Styles","3.8% - 5%","30-40 IBU","35-40 SRM","Nonic Pint","50-55° F","Asahi Super Dry-Asahi Breweries Ltd, Extra Dry-Tooheys, Dry Lager-Molson","Spicy stir-fries, barbecue, and curried dishes, Pizza","Dry beer is a style of beer that has little to no sweetness. That’s actually where the term “dry” applies – the lack of sweetness. It has nothing to do with the water content. Apart from this, dry beer generally has an absence of aftertaste. What you get is a strong, clean and refreshing taste. This type of beer is relatively new as a process, starting only in the ‘80s.","https://beerandwine.guide/beer/what-is-dry-beer/","410c11","Nonic"  ],
  ["American-Style Lager","Lager","North American Lager","4.1% - 5.1%","5-19 IBU","2-4 SRM","Flute","40-45° F","The Crisp-Sixpoint Brewing, Two Women-New Glarus Brewing Co., Luchesa Lager-Oasis Texas Brewing Co.","Pho, Smear Ripened Cheeses, Kettle Corn Balls","American lager has little in the way of hop and malt character. A straw to gold, very clean and crisp, highly carbonated lager.","https://www.craftbeer.com/styles/american-lager","e1c336","Flute"  ],
  ["American-Style Light (Low Calorie) Lager","Lager","North American Lager","2.5% - 5%","8-12 IBU","2-5 SRM","Flute","40-45° F","Bud Light-Anheuser-Busch, Coors Light-Coors Brewing Co., Miller Light-Miller Brewing Co.","Fried Foods, Mozzarella, Bread","The Light Lager is generally a lighter version of a brewery's premium lager, some are lower in alcohol but all are lower in calories and carbohydrates compared to other beers. Typically a high amount of cereal adjuncts like rice or corn are used to help lighten the beer as much as possible. Very low in malt flavor with a light and dry body. The hop character is low and should only balance with no signs of flavor or aroma. European versions are about half the alcohol (2.5-3.5% ABV) as their regular beer, yet show more flavor (some use 100 percent malt) then the American counterparts. For the most part, this style has the least amount of flavor than any other style of beer.","https://www.beeradvocate.com/beer/styles/39/","ddbd1b","Flute"  ],
  ["American-Style Low-Carbohydrate Light Lager","Lager","North American Lager","Varies","Varies","Varies","Flute","40-45° F","Michelob Ulta-Michelob Bewing, Corona Premier-Corona Brewing Co., Daytime IPA-Lagunitas","Fried Foods, Mozzarella, Bread","","","pink","Flute"  ],
  ["American-Style Amber Lager","Lager","North American Lager","4.4% - 6.1%","24-45 IBU","11-18 SRM","Tulip","45-55° F","HopBack Amber-Troegs Brewing Co., Boont Amber-Anderson Valley Brewing Co., Red Seal, North Coast Brewing Co.","Barbecue, Medium Cheddar, Banana Pound Cake","Like most amber beers, American amber ale is named after the golden to amber color this American version of English pale ale exhibits. The color is derived from the use of caramel and crystal malt additions, which are roasted to provide amber beers with the color, body and flavor many beer fans have come to appreciate. Falling under the ale beer type, amber ales ferment at warmer temperatures for what is typically a much shorter amount of time than lager style beers.","https://www.craftbeer.com/styles/amber-ale","a0571f","Tulip"  ],
  ["American-Style Premium Lager","Lager","North American Lager","4.6% - 6%","6-20 IBU","2-6 SRM","Flute","40-45° F","Stella Artois-Anheuser–Busch, Premium Lager-Kulshan Brewing co.,","Creamy, light-bodied fresh cheeses like Mozzarella, Fried Foods","Premium American Lagers fill the gap between the lighter American lagers, with little to no flavor, and the Munich Helles and Dortmunder Export, which are very flavorful, rich beers. You will notice the names on some of the commercial examples use the word “extra” to indicate that they actually have some flavor, although not strong yet. These are the beers that compete with the “gourmet” beers from Europe, such as Stella Artois.","https://winning-homebrew.com/premium-american-lager.html","dab700","Flute"  ],
  ["American-Style Pilsener","Lager","North American Lager","4.5% - 5%","8-15 IBU","3-6 SRM","Vase","40-55° F","The Crisp-Sixpoint Breing, Session Pils-Notch, Walker Pivo Pils-Firestone","Muenster, Havarti, Salmon, Tuna, Asian Food, Mexican Food","The much-maligned American pilsner (it can’t even be marketed as a pilsner in Europe) is making a comeback, but its humble roots date to the 1800s. German immigrants brought traditional pilsner brewing styles to America when they emigrated in the mid-19th century. Anheuser-Busch was one of the breweries that started with German immigrants and German brewing styles. American pilsners today are still closer to the German style, with a few key differences. “Up to 25% corn and/or rice in the grist should be used,” the Brewers Association writes. “This style represents the classic and unique pre-Prohibition American-Style pilsner.” The style generally has medium-low to medium sweet malt flavor, and medium to high European hop notes.","https://vinepair.com/articles/czech-german-american-pilsners/","d7b200","Vase"  ],
  ["American-Style Ice Lager","Lager","North American Lager","3.8% - 5%","7-20 IBU","2-8 SRM","Flute","40-45° F","Ive Beer-Milwaukee's Best, Ice lager-Keystone, Natural Ice-Anheuser-Busch","Fried Foods, Mozzarella, Bread, Pizza","American-Style Ice Lagers are very pale to golden. Chill haze is absent. Fruity-ester and diacetyl aromas should not be perceived. Hop aroma is low. Low residual malt sweetness is present. Hop flavor is low. Hop bitterness is low but certainly perceptible. This style is slightly higher in alcohol than most other light-colored, American-style lagers. It has few or no adjuncts. Typically these beers are chilled before filtration so that ice crystals (which may or may not be removed) are formed. This process can contribute to a higher alcohol content (up to 0.5% more). Fruity-ester and diacetyl flavors should not be perceived. Body is low to medium","https://beerrecipes.org/AHA-Style/107/american-style-ice-lager.html","d4ac00","Flute"  ],
  ["American-Style Malt Liquor","Lager","North American Lager","6.3% - 7.6%","12-23 IBU","2-6 SRM","Tulip","40-50° F","Fine Malt Liquor-Mickey's, Malt Liquor-colt 45, Malt Liquor-Olde English 800","Oysters, salad","Beers of this style are varied in character. Some malt liquors are only slightly stronger than American lagers, while others approach bock strength.","https://beermaverick.com/beer-style/american-style-malt-liquor/","dab700","Tulip"  ],
  ["American-Style Märzen / Oktoberfest","Lager","North American Lager","5.1% - 6%","20-30 IBU","4-15 SRM","Flute","45-50° F","Oktoberfest-New Glarus Brewing, Oktoberfest-Odelle Brewing Co, Hoss Oktoberfest Lager-Great Divide Brewing Co.","Kielbasa, Jalapeno Jack, Coconut Flan","The American version of this classic German beer is distinguished by a more pronounced hop character.","https://beermaverick.com/beer-style/American-style-maerzen-oktoberfest/","bb801b","Flute"  ],
  ["American-Style Dark Lager","Lager","North American Lager","4.1% - 5.6%","14-24 IBU","14-25 SRM","Nonic Pint","45-50° F","Shiner Bock-Spoetzl Brewery, Beck's Dark-Beck's Brewing, Guiness Black Lager-Guiness Brewing Co.","Sausage, Goulash, Bangers and Mash, Pizza","Dark American Lager is basically a dark pale lager that may have some residual sweetness from caramel malts and light roasted notes from the coloring malt. Many of the commercial examples are imports that don’t have enough flavor to make it into the other styles in this category. It is the least flavorful of the three styles in the Dark Lager category although some of the craft-brewed examples may have more body and flavor than the mass market examples. Many of these beers are made with coloring agents that darken the beer but do not add any substantial flavor to the base American lager.","https://winning-homebrew.com/dark-american-lager.html","85341d","Nonic"  ]
]